{
  "0": "Page rank. The factor is remapped.",
  "1": "Textual relevance (maxfreq - the frequency of the most frequent word, which makes sense of the length of the document).",
  "2": "Link Relevance. The factor is remapped.",
  "3": "Priority bonus, priority 7 - text priority. Factor is binary, has value 0 for all single word queries, and value 1 for almost all two or more word queries, except for a very small number of responses, for which there are no links that passed the quorum, and the text did not pass the quorum either.",
  "4": "Priority strict for TR is text priority - there are all query words somewhere in the document (and they pass contextual restrictions of the query, for example, both words d.b. in the same sentence).",
  "5": "The phrase priority for TR is text priority - there are all query words in a row in the document.",
  "6": "(strict) have all query words in one link.",
  "7": "(phrase) have all query words in a row in one link.",
  "8": "The presence of the exact phrase (query text) in the title (to be exact, in the first sentence of the document). Context constraints and stop words are taken into account exactly as in TRp2, i.e. factor[8] minors factor[5]",
  "9": "A quorum site was encountered in which all word positions are marked as having BEST_RELEV relevance (header or meta keywords).",
  "11": "This is news (determined by distinctive ((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/Klassificacionnye?v=tkd#h45859-3 patterns in url)) ).",
  "12": "This is a store offer (determined by the characteristic ((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/Klassificacionnye?v=tkd#h45859-4 patterns in url`)) ). Not used (deprecated)",
  "13": "This is a directory (determined by characteristic ((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/Klassificacionnye?v=tkd#h45859-2 patterns in the url)) or by the Yandex directory).",
  "14": "Attendance from Bar - ((http://wiki.yandex-team.ru/AndrejjKostjagin/YaBarLog/HostStat Data Description)). The factor is remapped.",
  "15": "Long document (the longer the document, the greater the value of the factor).",
  "16": "Hitweigt is a variant of textual relevance, in which the weights of all hits are considered equal (i.e. no premiums for title and word proximity are taken into account). In this case the relevant hits must pass the constraints of the syntactic wizard, i.e. we can assume that the TRhitw factor is 0 if and only if SoftAndOk is 0",
  "17": "The sum of the idf of the query words. The name does not reflect the essence: for example, for the query 'Gadyach' this factor will be greater than for the query 'Moscow Peter Yekaterinburg Samara'.",
  "18": "Long text without references.",
  "19": "It's a muzzle.",
  "22": "Indicates a match between the user's region and the site at the country level. The factor is binary: 1-match, 0-no. Based on ((http://wiki.yandex-team.ru/ЯндексПоиск/КлассификацияСайтовИСтраниц/Географическая/ИспользованиеВПоиске geoclassification of sites))",
  "23": "Matching thematic spectra of the query and the document. Subject of the query is the result of work ((http://wiki.yandex-team.ru/EvgenijjKroxalev/subquery SubquerySearch wizard rules)) Subjects of the document are taken from the Yandex catalog",
  "24": "A complex static rank, assembled from static components by a separate formula((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/#oftnd1 *)).",
  "25": "Factor about the number of refines. The query language has a user refines ('word preceded by a percent sign') feature. This is supposed to mean something like 'it would be nice to have a word in the document'. The only known ((http://staff.yandex-team.ru/gulin Andrey Gulin)) valuable use of this feature is querying [%official %site FirmName]. This feature is unknown to users, since it is not described in any documentation. It is planned that it will disappear from the query language, but the words with USER_REFINE priority will remain in the wizard. The factor tells you how many maximum USER_REFINE words were encountered simultaneously within a single quorum hit. It is said to be between 0 and 3 (if >3, it is said to be 3). This number is mapped to the half-interval [0,1)",
  "26": "The number by which some link factors (namely, factors number 6, 7, 47, 66) are multiplied if the textual relevance is 0 and there are few links",
  "27": "In textual relevance, a lemma match occurred.",
  "28": "Remapped mascot feature TrafgraphOutAll_share_d",
  "29": "Dssm model, trained on reformulations, uses relevant sentences in the document part",
  "30": "The value of the news detector calculated in behemoth. Always 0 when the detector value is less than the threshold.",
  "31": "The converted number of query words in all url links.",
  "32": "The document LR>20 has the number of occurrences of the query words in the links > 16, factor about LR.",
  "33": "For documents with high LR - normalized link relevance without regard to proximity, for documents with low LR 0",
  "34": "Url high LR.",
  "35": "Quality of incoming references (Leschiner's classifier) - broken, see [405]",
  "36": "CosineMatchMaxPrediction factor value for the AliceMusic stream",
  "37": "Number of incoming links. Remaps.",
  "38": "Popularity of the request",
  "39": "TR divided by the cube of the number of words in the query and converted by the standard remapTR.",
  "40": "The language of the document is Russian.",
  "41": "Page addition time, more is an older document; put the root of the time mapped to the interval [0,1] so that 3+ years gives 1.",
  "42": "If the main page of the owner (most often a second-level domain, such as xxxx.ru), the factor is 1. For bomzhatniki, hosting, personal blogs, etc. (eg, Lyfjornal, narod.ru, etc.) - third-level domains (such as xxxxx.narod.ru) will also have a factor of 1.",
  "43": "The owner (host?) main page addition time, remaps in the same way as AddTime.",
  "44": "The value of the AnnotationMaxValueWeighted factor for the AliceMusic streamer",
  "45": "How often the URL is clicked on this query - CTR multiplied by the correction factor",
  "46": "Simple BM25 by text.",
  "47": "Simple BM25 by links, link weights are not taken into account.",
  "48": "Simple BM25 by text and links at the same time.",
  "49": "All query words are in the text + links.",
  "50": "There are ads on the site.",
  "51": "There are Yandex ads on the site.",
  "52": "Spam classifier by anti-spam chips recognized the site as NOT(!) spam. I.e. 0=spam, 1=good.",
  "53": "Simple BM25 by word pairs - we take all pairs of query words and count the number of their occurrences in the text of the document. We use sum of word weights as pair weight. Comm Doesn't work if query has stop word",
  "54": "Same as TxtPair, but for links; link weights are not taken into account.",
  "55": "BM25 from the number of sentences in the document in which it occurs.",
  "56": "BM25 by the words in the title only.",
  "57": "BM25 on words only with high rel bits ('significant', with highlighting (<b>, etc.)).",
  "59": "Min(number of query words/10, 1.f)",
  "60": "1 / number_words_in_request.",
  "61": "The document does not have a TR.",
  "62": "The document does not have LR.",
  "63": "There is no information about clickability for this url for this request 1 - request or request-url is not in the clickbase, 0 - request-url is in the clickbase",
  "64": "For this query there is no information about clickability 1 - the query is not in the clickbase, 0 - the query is in the clickbase.",
  "65": "The number of hops of the url in a roundtrip (like less - closer to the muzzle, the smaller the value (0 - muzzle, 1 - cannot be reached from the muzzle, 0 < can be reached from the muzzle < 1). Normal value for nost root is 0.0039).",
  "66": "Logarithm from LR, linearly mapped in [0,1].",
  "67": "presence of word pairs in exact form",
  "68": "the number of sentences in which there are many words in the exact form",
  "69": "the presence of words in the title in the exact form",
  "70": "BM25 in exact form",
  "71": "A simple BM25 in precise form.",
  "72": "presence of word pairs with synonyms (>=TxtPair)",
  "73": "the number of sentences in which there are many words with synonyms taken into account",
  "74": "the presence of words in the title, taking into account synonyms",
  "75": "BM25 including synonyms",
  "76": "Simple BM25 with synonyms in mind.",
  "77": "How often the URLs of the given domainId are clicked on the given query - CTR domainId multiplied by the correction factor",
  "78": "For this domainId for this query there is no information about clickability 1 - request or request-owner is not in the clickbase, 0 - request-owner is in the clickbase",
  "79": "Clickability of the owner regardless of the request",
  "80": "Relative frequency of query words in links (1 - query words often occur in links, 0.3 - rarely); more precisely, the value of this factor is pessimized if: TR=0 && LR=0 && (no links with all query words) && (no quorum) && (at least one pair of query words occurs in the text)",
  "81": "The links have all the words of the query",
  "82": "One link has all the words of the query",
  "83": "There is a link that passed the quorum",
  "84": "What proportion of links are \"good\"",
  "85": "How many \"bad\" links (bad = dpr = 0)",
  "86": "Maximum dpr reference",
  "87": "TfIdf is usual TF*IDF by links. The word frequency in the references is multiplied by the inverse document frequency and summed over all words, then normalized to the document length.",
  "88": "Link relevance by Gulin",
  "89": "Link Relevance by Gulin",
  "90": "Link relevance by Gulin",
  "91": "There is an exact form of all query words in the text/links",
  "92": "There is a lemma of all query words in the text/links",
  "93": "The document passed softand by the syntax wizard's constraints. Only for documents with textual relevance. For single-word queries it is always 1.",
  "94": "Incoming link quality classifier 2 - broken, see [407]",
  "95": "equals one if the site has a Ukrainian geo-attribute (ie, 1 - Ukrainian site)",
  "96": "Blog page",
  "97": "Page from livejournal.com",
  "99": "Alexeyev's automatic spam classifier, probability that the site is spam (0 not spam, 1-spam)",
  "100": "Text quality. Calculated according to a rather complicated formula",
  "101": "Text quality (Alekseev's classifier)",
  "104": "The core audience of owners according to Yandex.Browsing",
  "105": "Host audience kernel according to Yandex.Browsing",
  "106": "Does the host have a kernel",
  "107": "Spam name karma of antispammers - probability that the host is spam; based on whois information",
  "108": "musicality of the request. The results of the work of wizard Anton Konygin.",
  "109": "the number of links that exactly match the query",
  "110": "Document length in sentences",
  "111": "URL length divided by 5",
  "112": "The commerciality of the query according to the Direkta phrase dictionary: 0 - maximum commerciality, 1 - minimum commerciality.",
  "113": "Raskovalov's host size in the documents without taking into account the doubles (each doubling is counted in the factor by an independent document)",
  "114": "Document type - HTML",
  "115": "The number inverse of the variance of the times of occurrence of links with the query words",
  "116": "Link relevance with thematicity",
  "117": "Link relevance with thematicity",
  "118": "Link relevance with thematicity",
  "119": "Link relevance taking into account the quality of each link",
  "120": "Link relevance taking into account the quality of each link",
  "121": "Link relevance taking into account the quality of each link",
  "122": "Link relevance, taking into account the quality of each link and the thematicity of each link",
  "123": "Link relevance, taking into account the non-commerciality of each link",
  "124": "Link relevance, taking into account the non-commerciality of each link and thematicity",
  "125": "Link relevance, taking into account the non-commerciality of each link and the quality of each link",
  "126": "Link relevance, taking into account the non-commerciality of each link, the quality of each link and thematicity",
  "127": "Means matching the region mentioned in the query and the found sites at the region level. The factor is binary: 1-match, 0-no. Based on ((http://wiki.yandex-team.ru/ЯндексПоиск/КлассификацияСайтовИСтраниц/Географическая/ИспользованиеВПоиске geoclassification of sites))",
  "128": "Percentage of incoming links with query words",
  "129": "Percentage of incoming links with all query words",
  "130": "Does the query contain words from yweb/pornofilter/porno.query.",
  "131": "Porn Chick document",
  "132": "A document from a commercially-available book. Not used (deprecated)",
  "133": "fake document",
  "134": "The title of the page contains commercial vocabulary. Not used (deprecated)",
  "135": "page from ru.wikipedia.org",
  "136": "commercial page (Savin's classifier)",
  "138": "the document does not contain all query words (to the nearest synonym)",
  "139": "Percentage of query words in the document (to the nearest synonym)",
  "140": "the document has all the words of the query (accurate to a synonym)",
  "141": "Percentage of query words in links (accurate to synonym)",
  "142": "the links have all the words of the query (accurate to a synonym)",
  "143": "The value of the commerce detector calculated in the behemoth.",
  "144": "TR by pairs of query words in reverse order",
  "145": "LR by pairs of query words in reverse order",
  "146": "TR by pairs of query words through one word in texts",
  "147": "LR by pairs of query words through one word in the texts",
  "148": "percentage of all query words in the text (to the exact form)",
  "149": "the document has all the words of the query (to the exact form)",
  "150": "Degree of centralization of the points from which the query is set",
  "151": "Does the query contain blog language?",
  "152": "log(LR, narrowed by the user's country)",
  "153": "log(LerfLR, narrowed to the user's country)",
  "154": "Binary non-commerciality: QueryNonCommerciality > 0.965.",
  "155": "Number of links that match the query text (other remap)",
  "156": "XLerfLRlogRelev (normalized by the sum of the Lerf-weights of all links, not by the sum of their initial weights)",
  "157": "XNonCommLRlogRelev (normalized by the sum of the NonComm weights of all references, not by the sum of their initial weights)",
  "158": "Link relevance, taking into account the non-commerciality of each link and thematicity",
  "159": "XNonCommLerfNormLRlogRelev (normalized to the sum of NonCommLerf-weights of all links, not the sum of their original weights)",
  "160": "Link relevance, taking into account the non-commerciality of each link, the quality of each link and thematicity",
  "161": "Not used Content Duplication. The 'goodness' of a host (0 to 1), calculated based on how many and which hosts borrow content from this one.",
  "162": "Not used Content Duplication. Host 'badness' (0 to 1) - proportional to the number of secondary content on the host.",
  "163": "Average age of links that contributed something to LR LinkAge=Min(log(average link age)/7, 1), for 1 took 3 years",
  "164": "Page text length in words TLen = Map(number of words, 1/400), where Map(x, y) = x*y / (1 + x*y)",
  "165": "The page is unreachable via links from the muzzle.",
  "166": "LR with reference and query language matching",
  "167": "LR taking into account the coincidence of the language of the link and the request and the tipping",
  "168": "The ratio of the number of clicks on the given url to all clicks on the request",
  "169": "The ratio of the number of clicks on the given domainId to all clicks on the query",
  "170": "[Bug: Copy Factor 45] How often a given URL is clicked on - CTR multiplied by the correction factor",
  "171": "What part (on average per session) of clicked on this request with user's city added to it is this url. It is counted by user's sessions.",
  "172": "How often a given URL is clicked on for a given query - CTR multiplied by the correction factor, by small regions from relev_regions.web.txt",
  "173": "How often the URLs of a given domainId are clicked on for a given query - CTR domainId multiplied by the correction factor, by small regions from relev_regions.web.txt",
  "174": "the ratio of the number of clicks on the given url to all clicks on the query, by small regions from relev_regions.web.txt",
  "175": "the ratio of the number of clicks on the given domainId to all clicks on the query, by small regions from relev_regions.web.txt",
  "176": "Query URL Clicks Combo, by small regions from relev_regions.web.txt",
  "177": "Query DOwner Clicks Combo, by minor regions from relev_regions.web.txt",
  "178": "LR by catalog descriptions",
  "179": "LR by unsubscription in Yandex.Catalog",
  "180": "Length of maximum matching forms in text and query",
  "181": "Weight of the maximum form match in the text and query",
  "182": "Length of maximal lemma match in the text and query",
  "183": "Weight of the maximum lemma match in the text and query",
  "184": "Maximum age of a significant accumulation of links that have contributed something to the LR",
  "185": "Variants of the relevant factors, taking into account the stop words",
  "186": "Variants of the relevant factors, taking into account the stop words",
  "187": "Variants of the relevant factors, taking into account the stop words",
  "188": "Variants of the relevant factors, taking into account the stop words",
  "189": "Variants of the relevant factors, taking into account the stop words",
  "190": "TR best passages - how good a snippet can get",
  "191": "TR with a discount for the offer number",
  "192": "Host rank by the most expressed query word (usually the name of the site)",
  "193": "The clickability of domAttr by the maximum word expressed. For example for all queries that have the word wikipedia click on wikipedia.",
  "194": "HostRank by individual words",
  "195": "Clickability of the domain by words",
  "196": "The URL satisfies the FORUM_DETECTOR regularity",
  "197": "AnnotationMatchWeightedValue factor value for the AliceMusic streamer",
  "198": "There is an ancient date in the URL. Ancient news are recognized. Factor 1 if url has year <=2007.",
  "199": "Weight of the maximum form match in the text and query",
  "200": "Weight of the maximum form match in the text and query",
  "201": "The page is about 'paying for SMS'.",
  "202": "Anti-spammers have pessimized the site - all dynamic link factors are zeroed. zerolnk.flt",
  "203": "Shopify the page",
  "204": "The pornographic nature of the page",
  "205": "Remapped mascot feature TrafgraphOutAll_share_m",
  "206": "Remapped mascot feature TrafgraphOutAllSE_share_d",
  "207": "Remapped mascot feature TrafgraphOutAllSE_share_m",
  "208": "Remapped mascot feature NoExtClicksShare",
  "209": "Search engine traffic - conversions from search engines to the site (2nd formula)",
  "210": "Search engine traffic - conversions from search engines to the site (2nd formula)",
  "211": "Visits to the site from search engines for individual words, according to the bar",
  "212": "The value of the BclmMixPlainK000001 factor for the AliceMusic stream",
  "213": "The largest common substring of the url and query, normalized by the length of the url",
  "214": "All matches are in the URL only, no matches in the text of the page",
  "217": "Three levels of matching user and page geography",
  "220": "Three levels of link and query region matching",
  "221": "Geographic proximity",
  "222": "Is the query navigable, by clickability of the answers",
  "223": "The most characteristic query word corresponding to the site, according to the bar",
  "224": "Clickability of the host by the first query word. Quite often the first (last) word of the query is an explicit indication of the site where the information should be searched for.",
  "225": "The value of the CMMatchTop5AvgMatch factor for the AliceMusic stream",
  "228": "The average continuous user time (in seconds) on the host pages after clicking on the query from a search engine (the factor depends on the pair (query,domAttr)).",
  "229": "the average continuous time (in seconds) of user's stay on the host's pages after the query from the search engine (the factor depends on the pair (query,domAttr)). According to Yandex.Bar/Elements/Browser internal counter",
  "230": "the average number of active actions (clicks, keystrokes) by users during a user's continuous presence on the host's pages after switching from the search engine (the factor depends on the pair (query,domAttr)). According to Yandex.Bar/Elements/Browser internal counter",
  "232": "Number of unique visitors from search engines for a particular query",
  "233": "the average continuous time (in seconds) a user is on a page after clicking on a query from a search engine (the factor depends on the pair (query,url)).",
  "234": "the average continuous time (in seconds) a user is on a page after he goes from a search engine (the factor depends on the pair (query,url)). According to the internal counter of Yandex.Bar/Elements/Browser",
  "235": "the average number of active actions (clicks, keystrokes) by users on the page after clicking on the query from the search engine (the factor depends on the pair (query,url))",
  "236": "A pool of PRS logs is tagged using Bert trained on sinsig. The dssm model is trained on this pool, using BaseRegionChain",
  "237": "A pool of PRS logs is tagged using Bert trained for relevance. The dssm model is trained on this pool, using BaseRegionChain",
  "238": "PerWordCMMaxMatchMin factor value for the AliceMusic stream",
  "239": "Value of the AttenV1_Bm15_K05 factor for the AliceMusic stream",
  "240": "The value of the AnnotationMaxValueWeighted factor for the AliceMusic streamer",
  "241": "The request is not in Russian",
  "242": "document from a foreign cluster",
  "243": "Page region size",
  "244": "The factor is inversely proportional to the size of the page region",
  "245": "Request region size",
  "246": "The factor is inversely proportional to the size of the region of the request",
  "247": "Geographical proximity of the user and the site",
  "248": "Characterizes the promotion of the site by link rings. The value is the share of external links that are included in the link rings and link exchanges.",
  "249": "the number of unique visitors, remaps exponentially",
  "250": "Share of traffic from search engines",
  "251": "the share of visits to the site not through links (hand-dialed or bookmarked)",
  "252": "the average continuous active user time (in sec) on the host pages",
  "253": "the average continuous user time (in sec) on the host's pages. According to the internal counter of Yandex.Bar/Elements/Browser",
  "254": "The average number of active actions (clicks, keystrokes) by users when a user is continuously on the host pages (in sec).",
  "255": "implementation of the algorithm described in the article ((http://wiki.yandex-team.ru//h.yandex.net/?http%3A%2F%2Fresearch.microsoft.com%2Fen-us%2Fpeople%2Ftyliu%2Ffp032-liu.pdf http://research.microsoft.com/en-us/people/tyliu/fp032-liu.pdf))",
  "256": "Attendance of the url according to me-bar data",
  "257": "Number of unique visitors to the url",
  "258": "The average time of user's presence on the page. It is counted as the difference between adjacent transitions.",
  "259": "This is SEA factor = s4_r/ (k_r+10) where s4_r - number of clicks > 180 sec, k_r - total number of clicks. It is calculated taking into account the reformulations.",
  "260": "This is SEA factor = s4_r/ (k_r+10) where s4_r - number of clicks > 180 sec, k_r - total number of clicks. It is calculated taking into account the reformulations. Localized version",
  "261": "The degree of diversity of queries clicked on this url",
  "262": "The page is commercial by keyword. Not used (deprecated)",
  "263": "Idf by different parts of the document, broken, not used",
  "264": "Idf by different parts of the document, broken, not used",
  "265": "Idf by different parts of the document, broken, not used",
  "266": "Idf by different parts of the document, broken, not used",
  "267": "The link factor about having a video on the page.",
  "268": "BM25 by user region for localizable queries, for non-localizable queries in CUBE - country. Texts of queries sent for regions can be viewed in relev_regions.txt in the wizard",
  "269": "Same for link relevance",
  "270": "Share of incoming sales links. An algorithm for recognizing commercial links has been implemented. The factor is remapped to [0,1] if the share of such links > 50%, otherwise 0. ((http://wiki.yandex-team.ru/SvetlanaShorina/topseolinks sample of cheated sites))",
  "271": "The previous factor multiplied by PornoQuery",
  "272": "CommLinksSEOHosts factor multiplied by NonCommercialQuery",
  "273": "The query mentions a product category. Not used (deprecated)",
  "274": "The query mentions a vendor. Not used (deprecated)",
  "275": "Geographical distribution of the request",
  "276": "The request is mostly made at night",
  "277": "The request is made mostly in the morning",
  "278": "The request is mostly made during the day",
  "279": "The request is mostly made in the evening",
  "280": "The severity of querying at different times of the day",
  "281": "Characterizes the frequency of words in links. The factor is large if the word played in the link relevance is rare for links.",
  "282": "Matching thematic spectra of the query and the document. The subject of the query is the result of the work ((http://wiki.yandex-team.ru/EvgenijjKroxalev/subquery SubquerySearch wizard rules)) The topic of the document is determined by the automatic classifier",
  "283": "Weight of query words that are in the text",
  "284": "Weight of query words that are in the links",
  "285": "Weight of query words that are in the text and links",
  "286": "Entropy - click distribution",
  "287": "Entropy - distribution of displays",
  "288": "Entropy - distribution of clicks/shows ratio",
  "289": "Document porn on the text of the link",
  "290": "Document porn on the text of the link, a different rationing",
  "291": "PornoQuery classifier, a different dictionary than PornoQuery",
  "292": "Value of the AttenV1_Bm15_K05 factor for the AliceMusic stream",
  "293": "Geographical proximity of the country of the site and the country of the request",
  "294": "Covering the domain with three letters from the query.  (Chelyabinsk lottery - chelloto. Translate the query into transliteration, find the three letters that are covered (che, hel, lot, olo), see what proportion of all three letters are covered.)",
  "295": "Same as the previous factor, but about the whole url except the domain",
  "296": "The query is locale-specific. The query is often reformulated with an explicit region assignment.  ((https://ml.yandex-team.ru/archive/thread1433892/#message1433892 more info))",
  "297": "We count text features, assuming that the page's title is assigned to each of its sentences, i.e. the distance between a word from the title and any other word is 1 sentence. Len - maximum ratio of words from the query found in some sentence of the text (with the assigned title) in relation to the length of the query. Пример [Хармс цирк Вертунов] для ((http://wiki.yandex-team.ru//h.yandex.net/?http%3A%2F%2Fwww.wikilivres.info%2Fwiki%2F%25D0%25A6%25D0%25B8%25D1%2580%25D0%25BA_%25D0%25A8%25D0%25B0%25D1%2580%25D0%25B4%25D0%25B0%25D0%25BC_%28%25D0%25A5%25D0%25B0%25D1%2580%25D0%25BC%25D1%2581%29 этого документа))",
  "298": "The ratio of the sum of the idf of the encountered words in the sentence+title to all words.",
  "299": "The same as JokerLen, on the exact forms",
  "300": "Same as JokerWeight, by exact shapes",
  "301": "Remapped mascot feature More120SecVisitsNotSearchShare",
  "302": "Analogs to the corresponding text factors for links.  BM25 from the number of links in which there was a match.",
  "303": "Simple BM25 on the exact form in the reference texts",
  "304": "The presence of word pairs in links, taking into account synonyms",
  "305": "Number of links that passed the threshold",
  "306": "Simple BM25 by links with synonyms",
  "307": "Video request",
  "308": "Clickability of the owner regardless of the request, separately by region",
  "309": "Entropy - click distribution. Regionalized",
  "310": "Entropy is the distribution of displays. Regionalized",
  "311": "Entropy - distribution of clicks/shows ratio. Regionalized",
  "312": "equals 2 * NastyContent",
  "313": "equals 2 * NastyContent",
  "314": "always zero",
  "315": ".com domain",
  "316": "Domain in the zone .ua",
  "317": "The domain is not in the .ru zone",
  "318": "LR by links from Yandex.Market",
  "319": "The poetry of the document",
  "320": "Maximum poetry of the quatrain",
  "321": "The language of the document is English",
  "322": "The query is completely covered by two exact groups consisting of exact match words of the query in a row ((http://wiki.yandex-team.ru/poiskovajaplatforma/tr/CoverageByGroups Progroup coverage))",
  "323": "There is a group consisting of exact match words of the query, covering the query (possibly with an omission, addition or substitution of a word)",
  "324": "The fraction of the query covered by the longest group consisting of any hits (including word forms and synonyms). Possibly with omission, addition or substitution of a word",
  "325": "Characterizes the proximity of time profiles of the request and documents on business days",
  "326": "Characterizes the proximity of time profiles of the request and documents on weekends",
  "327": "The language of the document is Cyrillic",
  "328": "Query factors - the result of ((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/GeoRegionality query geolocalization classifier))U- geo-relevant - regional output by query is meaningless",
  "329": "R- georelevant - regional results in the output could be useful, but no more than that",
  "330": "V- geovital - regional issuance is fundamental",
  "331": "There are no numbers in the url",
  "332": "The value of the AllWcmMaxMatch factor for the AliceMusic stream",
  "333": "CosineMatchMaxPrediction factor value for the AliceMusic stream",
  "334": "Indicates how unnatural the text is from the point of view of the Russian language. Evaluate how much of the document text can be considered synonymizer-generated or automatic at all. ((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/antispam?v=1il#h58953-2 more details))",
  "335": "Indicates how unnatural the text is from the point of view of the Russian language. Evaluate how much of the document text can be considered synonymizer-generated or automatic at all. ((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/antispam?v=1il#h58953-2 more details))",
  "336": "Indicates how unnatural the text is from the point of view of the Russian language. Evaluate how much of the document text can be considered synonymizer-generated or automatic at all. ((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/antispam?v=1il#h58953-2 more details))",
  "337": "nd/k normalized time to click",
  "338": "nd/i",
  "339": "nd/k",
  "340": "w/k",
  "341": "o/i",
  "342": "selected formula",
  "343": "r_s4b/(r_k + 10)",
  "344": "Does the query have full parsing",
  "345": "The date of the document, which is written on the page, is remapped by the square root",
  "346": "Remapped mascot feature VisitsPVisitors",
  "347": "Additional factors about the promotion of the site link rings , ((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/antispam?v=181r#h58953-4 more info))",
  "348": "Additional factors about the promotion of the site link rings , ((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/antispam?v=181r#h58953-4 more info))",
  "349": "Additional factors about the promotion of the site link rings , ((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/antispam?v=181r#h58953-4 more info))",
  "350": "The document has textual relevance",
  "351": "BM25, where the 'words' are the highlighted query segments",
  "352": "The 'weight' of the query segments in the text",
  "353": "Indicator of the unnaturalness of the text from the point of view of the Russian language. The number of bad word pairs in the text, renormalized in the interval [0,1] by the formula z/(z+10)",
  "354": "Proportion of bad pairs among all pairs found in the table: z/(x+1), where z is the number of bad pairs in the text, and x is the number ((http://wiki.yandex-team.ru/EvgenijjGrechnikov/TestSynonimizers 2000-relevant)) of pairs",
  "355": "the number of Latin letters in the text (not counting the markup), cornered in [0,1] by the formula n/(n+100)",
  "356": "Additional factors about the promotion of the site link rings , ((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/antispam?v=181r#h58953-4 more info))",
  "357": "Previous factors - corrected",
  "358": "Previous factors - corrected",
  "359": "Previous factors - corrected",
  "360": "Previous factors - corrected",
  "361": "factor, cleverly combined from FRC and pseudo-CTR",
  "362": "factor, cleverly combined from FRC and pseudo-CTR",
  "363": "Link relevance with pessimization for link age",
  "364": "The number of words in the text (the Word is what the lemmer highlighted), is mapped to [0,1] by the formula x/(x+A)",
  "365": "Number of Russian words in the title",
  "366": "Average word length",
  "367": "Percentage of words inside the <a>...</a> tag of all words",
  "368": "Percentage of words outside the tags (outside the <> brackets) of all words",
  "369": "Percentage of words that are the 200 most frequent words in the language from the number of all words in the text",
  "370": "Number of the 500 most popular language words used in the text, divided by 500",
  "371": "The logarithm of the geometric mean probability of trigrams in the text. (the probability of a trigram is the number of its occurrences in the text divided by the number of all trigrams) , displayed in [0,1] by the formula -x(x+A)",
  "372": "The logarithm of the geometric mean of the conditional probabilities of trigrams. the conditional probability of a trigram is its probability divided by the probability of the bigram of the first two words",
  "373": "An analogue of the QueryDOwnerClicksPCTR factor, differs from it in that queries are normalized by doppelgangers (details of such normalization are at ((http://staff.yandex-team.ru/finder by Andrei Plakhov)), code -ysite/yandex/doppelgangers)",
  "374": "An analogue of QueryDOwnerClicksPCTR factor, differs from it in that queries are normalized by doppelgangers (details of such normalization are in ((http://staff.yandex-team.ru/finder Andrei Plakhov)), code -ysite/yandex/doppelgangers). Localized to relev_regions.web.txt",
  "375": "An analogue of the QueryUrlClicksPCTR factor, differs from it in that queries are normalized by doppelgangers (details of such normalization are at ((http://staff.yandex-team.ru/finder by Andrei Plakhov)), code - ysite/yandex/doppelgangers)",
  "376": "An analogue of QueryUrlClicksPCTR factor, differs from it in that queries are normalized by doppelgangers (details of such normalization are in ((http://staff.yandex-team.ru/finder Andrei Plakhov)), code - ysite/yandex/doppelgangers). Localized to relev_regions.web.txt",
  "377": "BM25 by URL",
  "378": "There is a big picture on the page",
  "379": "A MatrixNet formula is applied to all factors (TG_UNUSED - to prevent entering any formulas)",
  "380": "The difference between the current date and the date of the document defined by DaterAge, 1 - document date is current, 0 - document is 10 years old or more, If no date is defined, equals 0.  Attention!((1 - DaterAge)*60)^2 = page age in days.",
  "381": "hard pessimization (aka PR=0), binary factor, counts in anti-spam",
  "382": "Host factors, determine link-stuffed sites - second and third inbound degrees ((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/antispam?v=181rh58953-4#cindegree12 more info))",
  "383": "Host factors, determine link-stuffed sites - second and third inbound degrees ((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/antispam?v=181rh58953-4#cindegree12 more info))",
  "384": "Number of incoming links without Russian letters. Remapsed.",
  "385": "Maximum number of forms for all query words - max for all query words number_form_for_word/64",
  "386": "Weighted by word weights, the sum of the number of forms is the sum over all words of the query number_form_for_word/64*word_weight; remap of the form x/(1 + x).",
  "387": "Unweighted sum of number of forms - sum over all query words number_form_for_word/64/number_words_query",
  "388": "Maximum number of forms for all query words",
  "389": "Weighted by word weights, the sum of the number of forms",
  "390": "Unweighted sum of the number of forms",
  "391": "Analogs of factors of the same name, word weight = 1",
  "392": "Analogs of factors of the same name, word weight = 1",
  "393": "Analogs of factors of the same name, word weight = 1",
  "394": "Analogs of factors of the same name, word weight = 1",
  "395": "Analogs of factors of the same name, word weight = 1",
  "396": "Analogs of factors of the same name, word weight = 1",
  "397": "Query segments are parts of a query that are themselves frequent queries.  The factor shows how much the segments break in the text. value 0 - all words occur only within the designated segments, 1 -- all occurrences break segments",
  "398": "The value of the CMMatchTop5AvgMatch factor for the AliceMusic stream",
  "399": "Proportion of different parts of speech in the text. proportion of numerals (among all words in which we were able to recognize the part of speech)",
  "400": "particle fraction",
  "401": "proportion of pronoun adjectives",
  "402": "proportion of pronouns",
  "403": "verb proportion",
  "404": "the proportion of words that can be both masculine and feminine nouns, but not neuter, among all nouns (examples: 'hummingbird' is an example of indefinite gender, which can be defined in two ways, 'Alexandra' is a homonym).",
  "405": "Quality of incoming references (Leschiner's classifier) corrected",
  "406": "Whether or not LinkQuality was counted for this page (not counted if there are few links) corrected",
  "407": "Incoming link quality classifier 2 corrected",
  "408": "In the query, the name of the organization (example: Gazprom, Gazprom) ((http://wiki.yandex-team.ru/ArsenGadzhikurbanov/Wares Description))",
  "409": "CMMatchTop5AvgMatchValue factor value for the AliceMusic stream",
  "410": "The size of the largest text segment of the page (from the [18] PureText factor)",
  "413": "link relevance without regard to rare words",
  "414": "Number of different internal links per page",
  "415": "A city is defined for the site",
  "416": "Query factors - result ((http://wiki.yandex-team.ru/PoiskovajaPlatforma/Lingvistika/ZaprosnyjeFactory/LocalizovannyjeZaprosy query geolocalization classifier)) - new version of factors [328]-[330]: U - geo-relevant - regional query output is meaningless;",
  "417": "Query factors - result ((http://wiki.yandex-team.ru/PoiskovajaPlatforma/Lingvistika/ZaprosnyjeFactory/LocalizovannyjeZaprosy query geolocalization classifier)) - new version of factors [328]-[330]: R - georelevant - regional results in the output could be useful, but no more than that;",
  "418": "Query factors - result ((http://wiki.yandex-team.ru/PoiskovajaPlatforma/Lingvistika/ZaprosnyjeFactory/LocalizovannyjeZaprosy query geolocalization classifier)) - new version of factors [328]-[330]: V - geolocal - regional issuance is fundamental.",
  "419": "PerWordCMMaxPredictionMin factor value for the AliceMusic stream",
  "420": "Ukrainian Page rank",
  "421": "=1 - on Download formula. Class queries: download/view online/play/photo/listen",
  "422": "Query classifier result - the query has words from the appropriate dictionary. brand",
  "423": "medical dictionary",
  "424": "Question",
  "425": "a request specific to Moscow",
  "426": "organization",
  "427": "porn",
  "428": "travels",
  "429": "The popularity of video, comes from video",
  "430": "Frequency of links to the site",
  "431": "Number of almost-periodic references",
  "432": "The number of impressions by request, normalized x/(100 + x).",
  "433": "The number of impressions of the url on the request, normalized x/(100 + x).",
  "434": "LiveInternet counter",
  "435": "Popularity of the owner in queries",
  "436": "DSSM model with early binding, trained on reformulations, and pre-trained on ASR hypotheses of musical queries to Alice",
  "437": "Model trained on PRS-log pool on Bert's prediction trained on sinsig_ce with a threshold of 0.5, using a chain of regions to country",
  "438": "DSSM model with early binding, trained on reformulations and retrained on music requests to Alice",
  "439": "Eleven factors based on statistical properties of the distributions of incoming vertex degrees referring to a fixed vertex of the hostgraph.((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/hostdegree details))",
  "440": "The value of the pirate detector calculated in behemoth.",
  "441": "Yandex music canonized url type - album",
  "442": "Calculated as (10-x) where x is the return of the document in days (continuous) relative to the validity time of the document in the samovar",
  "443": "Document host recognized in query",
  "444": "The URL consists only of the host that is recognized in the request",
  "445": "URL is a Yandex news story",
  "446": "URL feature computed from rapid clicks spy_log counters with decay of 1 day",
  "447": "URL feature computed from rapid clicks spy_log counters with decay of 1 day",
  "448": "URL feature computed from rapid clicks spy_log counters with decay of 0.5 days",
  "449": "URL feature computed from rapid clicks spy_log counters with decay of 0.5 day",
  "450": "They are calculated as (80 - x) / 80, where x is the age of the document in hours. The factors make sense only for the quickbot base (the last 80 hours). They are not used in ranking. They are used in reranking.",
  "451": "They are calculated as (80 - x) / 80, where x is the age of the document in hours. The factors make sense only for the quickbot base (the last 80 hours). They are not used in ranking. They are used in reranking.",
  "452": "The clever BM25 in a sliding window. The window size is set in sentences. Use \"jokers\" for titles and the beginning of the document. Morphological proximity and text structure are taken into account. The weight of the window fades with distance from the beginning of the document.",
  "453": "Factor about how good a snippet can get.",
  "454": "Simple BM25 by word pairs - take all pairs of query words and count the number of their occurrences in the text of the document. Weight =1. Comm Doesn't work if query has stop word",
  "455": "The logarithm of the number of shingles on which a given document is not unique",
  "456": "The logarithm of the number of shingles on which a given document owner is recognized as an author",
  "457": "Average weight of non-unique shingles of this document",
  "458": "Mascot feature MarketQualityRating",
  "459": "Medical host quality for new marks.",
  "460": "Medical host quality for new marks for experiments.",
  "461": "Finance or law host quality for new marks.",
  "462": "Finance or law host quality for new marks for experiments.",
  "463": "Finance or law host quality for new marks.",
  "464": "Finance or law host quality for new marks for experiments.",
  "465": "Factor for host in list of documentation cs hosts for experiments",
  "467": "It is calculated in the same way as HostRank factor, but not on the whole owner-graph, but on its subgraph consisting of owners of the given region. Region belonging is determined by TLD, or by presence in index of pages from given owner which geo or geoa classifier says that they are from given region. Mapped in the same way as the HostRank factor, to a number from 0 to 1 with 256 gradations",
  "468": "Document from the language section of wikipedia corresponding to the user region",
  "469": "The language of the document corresponds to the language of the request",
  "470": "Popularity of the request within the country",
  "471": "Degree of centralization of the points from which the request is made (within the country)",
  "472": "Geographical distribution of the request within the country",
  "473": "The hour in which this request is most frequently asked",
  "474": "The severity of querying at different times of the day (within the country)",
  "476": "The country of the document (domain) and the country of the user are the same ((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/OpisanijaFaktorov#nationaldomain details))",
  "477": "There's a porn ad on the page",
  "478": "URL feature computed from rapid clicks spy_log counters with decay of 3 days",
  "479": "Country localizability classifier - how much the query implies the country context",
  "480": "Number of slashes in the url",
  "481": "BM25 with different parameters for different fields, including incoming anchortext. The text weights of incoming links to the page are normalized according to the delta page rank of the link",
  "482": "Built-in video player on the page",
  "483": "Video for download",
  "484": "URL feature computed from rapid clicks spy_log counters with decay of 3 days",
  "485": "URL feature computed from rapid clicks spy_log counters with decay of 14 days",
  "486": "A service factor that was needed to search the site, and will still be needed in the future.",
  "487": "The factor is calculated from the text of the url using the quality/seq/gsk sequence classifier",
  "488": "Model with learning each trigram on '+' and '-' urls. It does not depend on the query.",
  "489": "URL feature computed from rapid clicks spy_log counters with decay of 14 days",
  "490": "Age of rapid clicks spy_log update, in seconds",
  "491": "Freshness of rapid clicks spy_log update",
  "492": "The size of the minimum chunk of text that includes all of the query words in the document. Not currently used. ((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/YMW more info))",
  "493": "Buettcher, Clarke, and Lushman Name Factor (modified) ((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/BCLm more info))",
  "494": "A measure of the 'commerciality' of a query. It is a complex factor calculated by MatrixNet using a formula based on the purchasing dictionary in directe-mail + logs of user requests + additional intent dictionaries.  Requests with the intent to buy factor tends to ->1 product queries ->0.6 with the intent not to buy, reviews, etc. -> 0 ((http://wiki.yandex-team.ru/AntonNeljubin/FaktorydljaNovogoKlassifikatorazaprosov factors classifier))((http://wiki.yandex-team.ru/JandeksPoisk/Antispam/AntiSEO/KlassifikatorKommercheskixZaprosov more about him))",
  "495": "Unigram linguistic model. The language model is modeled by document, smoothed by the general language model. When building a model by document, information about what field of the document the query word occurred in (Title, head, or plain text) is used",
  "496": "Matching geography defined from document url and query city (ip or lr)",
  "497": "Matching geography defined from document url and query area (ip or lr)",
  "498": "Coincidence of geography, defined from document url and country of request (ip or lr). Relevant for Russia and Ukraine.",
  "499": "Match the geography defined from the document url and the city in the query (GeoCity rule)",
  "500": "The value of the forked commerce detector calculated in behemoth.",
  "501": "Calculates the query coverage by the alphabetic trigrams of the document header",
  "502": "Calculates the header coverage by the alphabetic trigrams of the document title",
  "503": "Probabilistic model based on the texts of incoming links",
  "504": "Counts the sum of occurrences of the following: a sequence of query words longer than two occurring in one sentence; normalized to the length of the document.",
  "505": "Counts the sum of occurrences of the following form: a sequence of query words longer than two, occurring in one link; normalized to the number of links.",
  "506": "Share of clicks on navigation requests",
  "507": "The result has a geo-reference that does not match the user's geography at the city level ([415]==1 && [215]==0)",
  "508": "Geovitability of the query for results from the user's region",
  "509": "Geovitability of the query for results not from the user's region",
  "510": "the percentage of URLs that respond without errors",
  "511": "Matching thematic spectrum (by DMOZ) of the query and the document. The subject of the query is determined by ((http://wiki.yandex-team.ru/JandeksPoisk/ZarubezhnyjjInternet/DMOZqueryClassifier1 DMOZTheme wizard rule)) Document subject is determined by the automatic classifier",
  "512": "Matching thematic spectrum (by DMOZ) of the query and the document. Subject of the query is determined by the best result ((http://wiki.yandex-team.ru/JandeksPoisk/ZarubezhnyjjInternet/DMOZqueryClassifier1 DMOZTheme wizard rules)) Document subject is determined by automatic classifier",
  "513": "Estimates the minimum distance between pairs of query words, taking into account the distance of the pair from the beginning of the document (Minimal Pair Size with Attenuation). By pairs we mean all consecutive bigrams of query words. Thus, the number of pairs is equal to the number of words in the query reduced by 1. Accordingly, the factor makes sense for queries consisting of more than one word.((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/MPSA MPSA))",
  "514": "It differs from BCLm in that the weights of all words are counted equally. ((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/BCLm2 BCLm2))",
  "515": "Text relevance based on the language model, taking into account the absolute position. We go through the text with a box of 20 words, build for each box a language model (that is, probability distribution on the words of the Russian language) and calculate the probability of generating a query. For the distance from the beginning of the document penalize the model.",
  "517": "Page region size",
  "519": "Freshness of rapid clicks spy_log update, calculated at the request time",
  "520": "Releases to base searches under the isgeo name the maximum weight of the encountered geo-object in the query. By geo-object we understand an object of category Geo, Geo1, GeoAddr, GeoAddr1, LandMark, LandMark1 (see ((http://wiki.yandex-team.ru/AlekseySokirko/QueryObjects som's markup)).((http://wiki.yandex-team.ru/ArsenGadzhikurbanov/Wares Details))",
  "521": "Drops the maximum weight of the encountered object of category Music or Music1 in the query to the base searches under the name ismusic. (see ((http://wiki.yandex-team.ru/AlekseySokirko/QueryObjects som's markup)).((http://wiki.yandex-team.ru/ArsenGadzhikurbanov/Wares Details))",
  "522": "A modification of the Bclm2 factor, lightened for use in Fastranck. The main difference is that BclmLite does not use absolute word offsets relative to the beginning of the document. Instead the factor works with regular positions of the form <Number_offer, Position_in_offer>. The proximity between words is only taken into account within a sentence.((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/BCLmLite BCLmLite))",
  "523": "Results in the immediate vicinity ([pharmacies], [children's polyclinic]) are important when answering the query",
  "524": "When answering a query, the results within the city are important (the bulk of localizable queries)",
  "525": "When answering a query, the results from the user's area, region ([airport], [dairy]) are important",
  "526": "Number of incoming links from mordas",
  "527": "Corrected YmwFull. Only differs from previous version by behavior on 2-word queries. ((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/YMW more info))",
  "528": "Binary factor, every word of the query is in the text or in the links",
  "529": "uses 'country aux tree' (auxqc)",
  "530": "uses 'country aux tree' (auxqc)",
  "531": "Page - '404' (share of '404' tokens in relation to the total number of tokens on the page)",
  "532": "URL feature computed at the request time from rapid clicks spy_log counters with decay of 1 day",
  "533": "BM25, in which the weight of the word is machine-like",
  "534": "Factor evaluates how query words are grouped with each other in the text of the document without regard to their order. ((http://wiki.yandex-team.ru/SergejjKrylov/QueryWordCohesionTR description))",
  "535": "nd/k normalized time to click",
  "536": "URL feature computed at the request time from rapid clicks spy_log counters with decay of 0.5 days",
  "537": "nd/k",
  "538": "w/k",
  "539": "o/i",
  "540": "selected formula",
  "541": "r_s4b/(r_k + 10)",
  "542": "Number of letters in the Aux segment",
  "543": "Number of gaps in the Aux segment",
  "544": "Number of commas in the Content segment",
  "545": "The page is the store. ((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/OpisanijaFaktorov#isshop description)). Not used (deprecated)",
  "547": "The logarithm of the number of shingles in the document added by the site host as original texts in ((http://wiki.yandex-team.ru/JandeksPoisk/Jekosistema/MarketingPR/Webmasters/plan/vtorcontect Originality plugin)). It doesn't take part in the formula, it's needed for re-ranking of doubles",
  "548": "Average filtered number of sources of document authorship. Not included in the formula, needed for re-ranking of duplicates",
  "549": "((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/OpisanijaFaktorov#queryreftrigrams description))",
  "550": "((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/OpisanijaFaktorov#queryreftrigrams description))",
  "551": "IDF variance of query words if there are text hits in the document (mixed query-text factor)",
  "552": "UrlNGramsModel ranking factor in erf",
  "553": "The language of the document corresponds to the country of the request",
  "558": "Word order in references.",
  "559": "The degree of diversity of queries clicked by this url is counted by region",
  "560": "nd/i",
  "561": "Proportion of query segments present in the text",
  "562": "The language of the document is one of the allowed for Turkey (Turkish, English, German, French, Arabic, Azeri) or the document has zero length. At the search stage it is calculated only for IsRealGeoLocal queries.",
  "563": "A variation on the theme ((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/DBM25 DBM25)), see ysite/yandex/relevance/dbm25.cpp",
  "564": "Dispersion of document reference regions",
  "565": "Number of clicks on the owner and the number of clicks on the request more than 5",
  "566": "BM25FdPR with normalization to the average document length depending on the document language. ((http://wiki.yandex-team.ru/BM25FRework Test Results.))",
  "567": "The popularity of the document language. A number from 0 to 1. ((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/LanguagePopularity LanguagePopularity))",
  "568": "The sum of factors QueryDOwnerClicksFRC and BM25FdPRFixed with weights 0.358449 and 0.184922 respectively. The '565' in the factor name should not be taken literally, it is either a legacy or a typo.",
  "569": "The sum of factors 192 and 341 with weights of 0.298942 and 0.454625, respectively.",
  "570": "URL feature computed at the request time from rapid clicks spy_log counters with decay of 3 days",
  "571": "URL feature computed at the request time from rapid clicks spy_log counters with decay of 14 days",
  "572": "Factor evaluates the difference between the positions of words in the header and the positions of words in the query",
  "574": "Dispersion of languages in xmap",
  "575": "There is a typo in the query",
  "576": "A variation on the theme ((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/DBM25 DBM25)), see ysite/yandex/relevance/dbm25.cpp",
  "577": "The url is known to show up too often with very low relevance (by bert and/or by bm25)",
  "578": "The ratio of the number of incoming links whose text is a URL to the number of all incoming links",
  "579": "A pool of PRS logs is tagged using Bert trained on sinsig. The dssm model is trained on this pool, using BaseRegionChain",
  "580": "The number of 'notbooks' in the url",
  "581": "URL length to within a character. Disabled in production.",
  "582": "Haboost of the page",
  "583": "Degree of commerciality of the page header. Not used (deprecated)",
  "584": "BM25 of the page title by its text",
  "585": "BM25 page title by the text of the links to it",
  "586": "Number of incoming seo-trash links between hosts",
  "587": "Static URL factor by search sessions for 1600 days calculated by mobile sessions. Average DwellTime, and DwellTime from session is truncated if more than 180 seconds",
  "588": "Static URL factor by search sessions for 1600 days calculated by mobile sessions.  Probability that the click on the URL will be more than 120 seconds",
  "589": "Static URL factor by search sessions for 1600 days calculated by mobile sessions. The probability that the URL will not be clicked if at least one URL is clicked is lower.",
  "590": "Static URL factor by search sessions for 1600 days calculated by mobile sessions. Average DwellTime, and DwellTime from session is truncated if more than 3600 seconds. Localization to country level.",
  "591": "Static URL factor by search sessions for 1600 days calculated by mobile sessions. Average DwellTime, and DwellTime from session is truncated if more than 180 seconds. Localization to country level.",
  "592": "The value of the health detector calculated in behemoth.",
  "593": "OffersBase feature for ecoboost.",
  "594": "OffersBase feature for ecoboost.",
  "595": "OffersBase feature for ecoboost.",
  "596": "OffersBase feature for ecoboost.",
  "597": "Share of unique title trigrams in the link trigrams",
  "598": "Share of unique link trigrams in the title trigrams",
  "599": "The publicity of the page",
  "600": "Similar to YabarUrlVisits",
  "601": "The document URL corresponds to the user's region(s) ((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/geo/RegNavQueries /JandeksPoisk/KachestvoPoiska/geo/RegNavQueries))",
  "602": "The URL of the document corresponds to the user's city",
  "603": "Regional navigational query - there are one or more navigational results in the user's region",
  "604": "Number of sessions in which the url was the last, divided by the number of sessions in which the url appeared",
  "605": "The sum of the maximum SourceRank values for each incoming link, taking into account the uniqueness of the owner.",
  "606": "BM25 by texts and links with special scales by level of matching (form, lemma, synonym)",
  "607": "Weight of query words that are in the text in exact form",
  "608": "Weight of query words that are in the text with exact lemma",
  "609": "Weight of query words that are in the text",
  "610": "Drops the maximum weight of the encountered object of category Hum or Hum1 in the query to base searches under the name ishum. (See ((http://wiki.yandex-team.ru/AlekseySokirko/QueryObjects soma markup)).((http://wiki.yandex-team.ru/ArsenGadzhikurbanov/Wares#ishum Details))",
  "611": "Drops the maximum weight of the encountered object of category Text or Text1 in the query to the base searches under the name istext. (See ((http://wiki.yandex-team.ru/AlekseySokirko/QueryObjects soma markup)).((http://wiki.yandex-team.ru/ArsenGadzhikurbanov/Wares#istext Details))",
  "612": "Drops the maximum weight of the encountered Picture or Picture1 category object in the query to the base searches under the name ispicture. (See ((http://wiki.yandex-team.ru/AlekseySokirko/QueryObjects som's markup)).((http://wiki.yandex-team.ru/ArsenGadzhikurbanov/Wares#ispicture Details))",
  "613": "Returns under the name wmaxone the maximum degree of naming of the encountered objects in the query. (see ((http://wiki.yandex-team.ru/AlekseySokirko/QueryObjects som's markup)).((http://wiki.yandex-team.ru/ArsenGadzhikurbanov/Wares#maxone More))",
  "614": "Returns, under wminone, the maximum degree of naming of the encountered objects in the query. (see ((http://wiki.yandex-team.ru/AlekseySokirko/QueryObjects som's markup)).((http://wiki.yandex-team.ru/ArsenGadzhikurbanov/Wares#minone More))",
  "615": "Bm25 by query index for domAttr",
  "616": "Bm25 by query index for domAttr",
  "617": "Bm25 by query index for domAttr",
  "618": "BCLM by query index for domAttr",
  "619": "BCLM by query index for owners",
  "620": "Allows you to assess whether a document is 'live' in terms of references to it coming in.",
  "621": "Maximum sum of query word weights in a window of 50 words",
  "622": "Similar to YabarUrlVisitors",
  "623": "Similar to YabarUrlAvgTime",
  "624": "The core audience of pages that have a Metrics counter",
  "625": "Share of clicks on this url among all clicks on similar requests",
  "626": "corrected CTR of this url for all similar queries",
  "627": "Clickability of the domain by bigrams (without taking into account thesaurus query extensions)",
  "628": "Visits to the site from search engines by bigrams, according to Bar (without taking into account thesaurus query extensions)",
  "629": "Clickability of the host for the last word of the query (without taking into account thesaurus query extensions)",
  "630": "OffersBase feature for ecoboost.",
  "631": "OffersBase feature for ecoboost.",
  "632": "Business kernel.",
  "633": "Business kernel.",
  "634": "Business kernel.",
  "635": "URL feature computed at the request time from rapid clicks search counters with decay of 1 day",
  "636": "A copy of the ((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/Locm LOCM)) factor for ((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/Synset synsets)).",
  "637": "Copy of LinkBM25 factor for ((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/Synset synsets)).",
  "638": "URL feature computed at the request time from rapid clicks search counters with decay of 30 days",
  "640": "The most probable topic of the query defined ((http://wiki.yandex-team.ru/JandeksPoisk/ZarubezhnyjjInternet/DMOZqueryClassifier1 DMOZTheme wizard rule)), only the most popular topics are taken into account (but there are more than in the DmozQueryThemes factor). The factor contains probability of matching of the query to the theme, but for each theme is taken a different interval on the interval [0...1].",
  "641": "Query topic defined ((http://wiki.yandex-team.ru/JandeksPoisk/ZarubezhnyjjInternet/DMOZqueryClassifier1 DMOZTheme sorcerer rule)), only a few of the most popular topics are taken into account.",
  "642": "0 or 1 depending on the presence of an explicit need_photo intent in the request from the variety",
  "643": "0 or 1 depending on whether the query has an explicit need_map intent of the variety",
  "644": "Factor is analogous to LongQuery (sum of query word idf), but with 'correct' synonyms. Specifically, the minimum of idf (i.e. the most frequent) of synonyms and words is selected.",
  "645": "The url contains a token that matches the short name of the user's country. The factor counts only on the EU thread.",
  "646": "Personalized Turkish PageRank",
  "647": "Expected number of searches on the query",
  "648": "Share of unique trigrams of the footer fragment in the link trigrams",
  "649": "Share of unique link trigrams among the fragment of footer trigrams",
  "650": "Binary logarithm of the query probability by the erratum service language model",
  "651": "Url is an offerer in the latest version of the marketplace base.",
  "652": "A variation on the theme ((http://wiki.yandex-team.ru/JandeksPoisk/KachestvoPoiska/ObshayaFormula/TekushhieKomponenty/DBM25 DBM25)), see ysite/yandex/relevance/dbm25.cpp",
  "654": "BM25 variation",
  "655": "BM25 variation",
  "656": "BM25 variation",
  "657": "'Fixed' clicks counted with RequestAggregateLib",
  "658": "'Fixed' clicks counted with RequestAggregateLib. Regional Version",
  "659": "Regional Attendance of the url according to me-bar data",
  "660": "Average time of user's stay on the host in case of external (from another nonsearch site) access from a particular URL",
  "661": "Average 'depth' (number of hits within a host) of user's stay on the host during external (from another nonsearching site) visits from a particular URL",
  "662": "DBM separately by number",
  "663": "DBM separately by geo-request objects",
  "664": "DBM separately for nouns",
  "665": "Average length of the logical session in which there was a request",
  "666": "Bclm (weighted) by lyrics from hops.",
  "667": "bounce rate",
  "668": "Assesses whether the positions of words in the document sentences match the positions of words in the query.",
  "669": "The churn rate of users from search after a visit to the site",
  "670": "The document contains the name from the request.",
  "671": "This is index.(html/php/aspx?/...), without cgi parameters. It counts for all doublers.",
  "672": "This is index.(html/php/aspx?/...), possibly with cgi parameters. It counts for all doublers.",
  "673": "Whether the host is its own owner, conditionally Host == Owner(Host).",
  "674": "Minimum PathAndQuery length over all half-doubles.",
  "675": "Regionalized version of XLerfGeoLRlogRelev factor (only links from the country of the request are taken)",
  "676": "Regionalized (only links from request country are taken) variant of XNonCommLerfNormLRlogRelev factor",
  "677": "Regionalized (only links from the country of the request are taken) variant of Locm factor",
  "678": "Regionalized (only links from the country of request are taken) variant of XLRrelev factor",
  "679": "Regionalized (only links from the country of request are taken) variant of XLerfLRrelev200 factor",
  "680": "((http://wiki.yandex-team.ru/JandeksPoisk/Antispam/polunavigacionnyezaprosy#faktornavigacionnostiparyurl-zapros classifier)) pairs vitals [query-url], url vitals for query if value on it >0.5",
  "681": "Classifier for commercial site evaluations",
  "682": "There is a direct link to the file on the document",
  "683": "The document has a link to filehosting",
  "684": "0 or 1 - whether the request matches the regulars from the ticket",
  "685": "0 or 1 - whether the request matches the regulars from the ticket",
  "686": "0 or 1 - whether the request matches the regulars from the ticket",
  "687": "Predicting the proportion of \"good\" (at least with two different cities and frequency>=10) mentions of the query with geography in Turkey",
  "688": "The result of the lexical query classifier that predicts the probability of a click on the 3561 subject page",
  "689": "The result of the lexical query classifier that predicts the probability of a click on the 3973 subject page",
  "690": "Query 'navigability' rank",
  "691": "Regional traffic from search engines for a particular query",
  "692": "Clicks on the urls shown in the output for queries that have gone to other search engines",
  "693": "Showing urls in the output for queries that have gone to other search engines",
  "694": "Classification of commerciality of the site",
  "695": "In the latest version of the base of the marketplace there are offers from this host.",
  "696": "The proximity of the query words to the hardest word.",
  "697": "The url satisfies the regexp-expression defined in the prone",
  "698": "The document contains user feedback/comments",
  "699": "Share of clicks on a given url among all clicks on similar queries, country version, see ((http://wiki.yandex-team.ru/Development/Poisk/arcadia/indexregex indexregex))",
  "700": "corrected CTR of this url for all similar queries, country version, see ((http://wiki.yandex-team.ru/Development/Poisk/arcadia/indexregex indexregex))",
  "701": "Average amount found by query",
  "702": "Angle in the Depth Nodes space, counted by words only (Min for all)",
  "704": "Classifier that approximates the quality of commercial sites based on user behavior data",
  "705": "Document creation time with month accuracy 1.0 -- current month, 0 -- 10 years ago and older. Temporarily disabled",
  "706": "Document update time with month accuracy 1.0 -- current month, 0 -- 10 years ago and older. Temporarily disabled",
  "709": "The year distribution likelihood function in the document. Temporarily disabled",
  "710": "Num of Sovetnik urls",
  "711": "The variance of the number of query words in the links.",
  "712": "The arithmetic average of date positions in the document. Temporarily disabled",
  "714": "BM with fading in the text of the catalog references.",
  "715": "Average url position by normalized query",
  "716": "Average domAttr position by normalized query",
  "717": "Average url position for all queries",
  "718": "Average host position for all queries",
  "719": "Number of requests per url",
  "720": "Number of requests per host",
  "721": "implementation of the algorithm described in the article ((http://wiki.yandex-team.ru//h.yandex.net/?http%3A%2F%2Fresearch.microsoft.com%2Fen-us%2Fpeople%2Ftyliu%2Ffp032-liu.pdf http://research.microsoft.com/en-us/people/tyliu/fp032-liu.pdf)) by major regions (TRUBK)",
  "723": "Proportion of document words from segments with score > 2.",
  "726": "Site quality rank used for Moscow commercial formula boosts",
  "731": "Factor is used in SelectionRank. TG_UNUSED: should not be included in formulas to avoid feedback",
  "735": "URL feature computed at the request time from rapid clicks search counters with decay of 3 days",
  "737": "Weight of the document according to the one-word dictionary of commercial vocabulary",
  "741": "Shows that the request is in Ukrainian",
  "742": "Average query commerciality",
  "743": "Number of queries in the group of frequency queries similar to the specified one",
  "744": "FRC group of frequency queries similar to the specified one, with averaging through the sum of clicks and impressions",
  "745": "FRC group of frequency queries similar to the specified one, with averaging through the sum of clicks and impressions, according to regional statistics",
  "746": "URL feature computed from rapid clicks search frozen counters with decay of 1 day",
  "747": "The relative popularity of the word-host pair, where word is the word in the title of the Wikipedia article and host is the host referenced in the article.",
  "748": "Relative clickability of countryId-word-host triplets according to Yandex searches.",
  "749": "Relative clickability of countryId-word-host triplets according to data from popular search engines according to Bara and SimilarGroup logs.",
  "750": "Share of clicks on this url among all clicks on similar queries, calculated by popular search engine",
  "751": "Petal length Depth Nodes, calculated for hosts",
  "752": "Angle variance in Nodes Time space, calculated for hosts",
  "753": "0.9-quantile of the lobe length in Nodes Time space, calculated for hosts",
  "754": "Average by the words of the query the probability of downloading a file from the host after a click.",
  "755": "The nastiness factor of content.",
  "756": "CTR by click data, request normalized by synset",
  "757": "Regional CTR by click data, query normalized by synset",
  "758": "Static trigrams intercection of url and queries by which users visited the url.",
  "760": "The result of the sorcerer's rule.",
  "761": "Weighted BM15 for a query by index document - a list of queries to which it has been navigated.",
  "764": "Probability of downloading from the host after the click (according to Bar logs).",
  "765": "Number of chains by request / (number of chains in which the url participated + number of chains by request).",
  "766": "The number of chains in which the url was last, normalized to the total number of chains in which the url was.",
  "767": "Number of hits to the Wikipedia url",
  "768": "URL feature computed from rapid clicks search frozen counters with decay of 30 days",
  "769": "Indicator of the page as a hub (how many pages Bar users go to from it).",
  "770": "It counts TextBM25 in the title by the text of the user's region name - similar to factor 268.",
  "771": "BCLM for Annotation index, doc text and links.",
  "772": "Dssm probability prediction by url + title that there are no products on the page.",
  "773": "FRC of a popular search engine by browser logs",
  "774": "Weighted mean of log(query_clicks)/log(query_shows) for given host. Weights are proportional to log(query_shows) + 0.2.",
  "775": "The number of hits on the url occurring in the chain of hops, normalized to the total number of hits on the request.",
  "776": "The probability of the url being the last on the request in the chain of hops.",
  "777": "Dssm probability prediction by url + title that there is one product on the page.",
  "778": "Dssm probability prediction by url + title that there are many products on the page.",
  "779": "URL feature computed from rapid clicks search frozen counters with decay of 3 days",
  "780": "The geo-referencing of the city level is defined for the url according to BUKI-1125 rules",
  "781": "Country level geo-referencing is defined for the url according to BUKI-1125 rules",
  "782": "Factor GeoRelevRegionCity by geoa attribute",
  "783": "Factor GeoRelevRegionRegion by attribute geoa",
  "784": "GeoGeometryProxim factor by geoa attribute",
  "785": "GeoRelevAlienCity factor by geoa attribute",
  "786": "GeoVQueryInUserCity factor by geoa attribute",
  "787": "GeoVQueryInAlienCity factor by geoa attribute",
  "788": "Factor PageRegionSize by attribute geo",
  "789": "PageRegionCoverage factor by geo attribute",
  "790": "The PageRegionCoverage factor by the adresa attribute",
  "791": "Factor GeoRelevRegionCity by attribute adresa",
  "792": "What fraction (on average per session) of clicked on this query url is this url. Calculated by user sessions.",
  "793": "Ovner is a store",
  "794": "Ovner is a service",
  "795": "Bclm (plane) by the texts from the hops.",
  "796": "FRC on transitions from queries that were set by the user several times",
  "797": "Average weight of impressions on the first page; a click weighs 1, a non-click weighs 1 according to the SBM_GAMMAS table",
  "798": "Average weight of impressions on the first page; click weights 1, non-click weights 1 according to the SBM_GAMMAS table. Regional version",
  "799": "the half sum of the evaluation of the url position with the median position for all similar queries by bist",
  "800": "Host feature computed at the request time from rapid clicks spy_log counters with decay of 3 days",
  "801": "Host feature computed at the request time from rapid clicks spy_log counters with decay of 3 days",
  "802": "Host feature computed at the request time from rapid clicks spy_log counters with decay of 14 days",
  "803": "Host feature computed at the request time from rapid clicks spy_log counters with decay of 14 days",
  "804": "Host feature computed at the request time from rapid clicks spy_log counters with decay of 3 days",
  "805": "Host feature computed at the request time from rapid clicks spy_log counters with decay of 14 days",
  "806": "Host feature computed from rapid clicks spy_log counters with decay of 3 days",
  "807": "Host feature computed from rapid clicks spy_log counters with decay of 3 days",
  "808": "Host feature computed from rapid clicks spy_log counters with decay of 14 days",
  "809": "Host feature computed from rapid clicks spy_log counters with decay of 14 days",
  "810": "Host feature computed from rapid clicks spy_log counters with decay of 3 days",
  "811": "Host feature computed from rapid clicks spy_log counters with decay of 14 days",
  "812": "Finetuned reformulations DSSM to commercial clicked bargain odd-like target from visit log",
  "813": "Is video distributor legal",
  "814": "Average value of feature OneProductProbability",
  "815": "Average value of feature ManyProductsProbability",
  "816": "Average value of feature PayDetectorPredict",
  "817": "Ovner is a partner",
  "818": "The document is ShopInShop",
  "819": "The value of the conversion rate of the query calculated in behemoth.",
  "820": "Factor by name from the original query Computed from the contents of the document. Algorithm: Chain0Wcm.",
  "821": "At least one of the offers from the distributed scheme has a status of availability.",
  "822": "There is not a single offerer in the unraveled scheme.",
  "823": "For the url from ytier it is known that it has low quality content",
  "824": "For the url from ytier we know that its content is of acceptable quality",
  "825": "For the url from ytier it is known that he has good quality content",
  "826": "For the url from ytier it is known that he has excellent quality content",
  "827": "On the host there is a purchase on the EUOM.",
  "828": "There is a VISIT LOG purchase on the host.",
  "829": "The URL is a product on the Marketplace.",
  "830": "The URL is a product on the Marketplace and has an offerid.",
  "831": "The URL is ShopInShopCPA.",
  "832": "At least one of the offers from the distributed scheme has the status of unavailability.",
  "833": "There is a purchase on the EUOM.",
  "834": "There is a VISIT LOG purchase on the owner.",
  "835": "Dssm probability prediction by url + title that the document is a sponger.",
  "836": "The PartnerOfferContent available field in the new parser.",
  "837": "In the offerer from the new parser the field PartnerOfferContent available == true.",
  "838": "Normalized corrected clicks count by query with user's city(gc=) mentioned",
  "839": "Normalized corrected clicks maximum ratio by query with user's city(gc=) mentioned",
  "840": "Normalized corrected clicks maximum ratio by query with not user's city(gc=) mentioned",
  "842": "The value of PurchaseTotalPredict calculated in the behemoth.",
  "843": "The value of SerpSummarySurplusPredict calculated in behemoth.",
  "844": "User retrievability at the url",
  "845": "The value of RequestWith120D3ClickPartPredict calculated in behemoth.",
  "846": "Value of the query detector of the spongers calculated in the behemoth.",
  "847": "Logarithm of the average time a user was on a host with localization by country; calculated from Yabar logs",
  "848": "Ratio of dwell time on a host in a given region to dwell time on a host in all regions",
  "849": "Ratio of dwell time on the page in the given region to the dwell time on the page for all regions",
  "850": "The more users add to bookmarks a url, the more factor value it has",
  "851": "Predicting sos.dssm model by url + title.",
  "852": "Predicting med.dssm model by url + title.",
  "853": "Predicting fin_law.dssm model by url + title.",
  "854": "This url has a link from Infoboxes on Wikipedia.",
  "855": "Predicting cruelty.dssm model by url + title.",
  "856": "The value of HalfEcomPredict, calculated in behemoth.",
  "857": "A factor similar to RegexMaxClickPercentReg, but calculated by preffix-suffix generalization.",
  "858": "A factor similar to RegexMaxClickPercentYabarReg, but calculated by preffix-suffix generalization.",
  "859": "A request-document model of navigability.",
  "860": "Average slope angle in the vertex-hanging plane",
  "861": "QueryUrl factor. Value - result of collaborative data filtering for the QueryUrlCorrectedCtr factor",
  "862": "The value of the MatrixNet slow ranking model.",
  "863": "The value of the MatrixNet fast ranking model.",
  "864": "The value of the MatrixNet filter model.",
  "866": "Factor in the text of the query and the title of the document, assessing the correspondence of the numeric ranges at the marker words",
  "867": "The Polynom value of the slow ranking model.",
  "868": "The value of Polynom fast ranking model.",
  "869": "The value of the Polynom filter ranking model.",
  "870": "An indication that the document was received by machine translation",
  "871": "Predicting med_with_trash.dssm (med. doc. model with lerne trash infusion) model by url + title.",
  "872": "Predicting fin_law_with_trash.dssm (fin_law_with_trash.dssm) model by url + title.",
  "873": "Factor by name from the original query It is counted by the content of the document. Minimum window size, which includes all the words of the query. Normalized by the number of words in the query.",
  "874": "Factor by name from the original query Document text. CosineMatchMaxPrediction algorithm.",
  "875": "Factor by all names from the original query Aggregation by all extensions. Aggregation type by extension: largest factor value; Computed by document content. Algorithm: Chain0Wcm.",
  "876": "Factor by all names from the original query Aggregation by all extensions. Type of aggregation by extensions: the largest factor value; Computed by document content. Minimum window size that includes all query words. Normalized by the number of words in the query.",
  "877": "Share of the url in the total number of clicks per session on the request (synnorm).",
  "878": "The average share of clicks on this url for this query among all clicks on this query (synnorm) during the day.",
  "879": "The average share of clicks on this url for this query among all clicks on this query (qnorm) during the day.",
  "880": "QI version of factor 861. MaxValue over the set of popular similar queries.",
  "881": "QI version of factor 798. MaxValue over the set of popular similar queries.",
  "882": "Factor by all names from the original query Aggregation by all extensions. Type of aggregation by extensions: largest factor value; Document text. CosineMatchMaxPrediction algorithm.",
  "883": "Dssm, predicting page quality score for a document",
  "886": "Query-url factor. The value is the result of collaborative data filtering for the SamplePeriodDayFrc factor",
  "887": "The value of the MatrixNet fast filter model.",
  "888": "The value of Polynom fast filter ranking model.",
  "889": "QI version of factor 879.",
  "890": "The value of MatrixNet on the meta.",
  "891": "Meaning of Polynom on the Mete.",
  "892": "A document is a short video (ticktock, reels, shorts).",
  "893": "The document is a telegram channel in web format.",
  "894": "The document is a post in a telegram.",
  "895": "CorrectedCtrReg factor in the annotation index, AnnotationMatchPrediction factor",
  "896": "CorrectedCtrReg factor in the annotation index, QueryMatchPrediction factor",
  "897": "CorrectedCtrReg factor in the annotation index, ValueWcmAvg factor",
  "898": "CorrectedCtrReg factor in the annotation index, factor Bm15V4K5",
  "899": "Factor about presence of '?' symbol in url. Equals zero if url has cgi parameters (more precisely: all duplicates have '?' symbol in url).",
  "900": "DSSM click prediction from Alice-specific data",
  "901": "Factor by phone attributes tel_full from the original query Text document. Bocm15 word weight aggregation algorithm. The normalization coefficient is 0.01.",
  "903": "SamplePeriodDayFrc factor in the annotation index, QueryMatchPrediction factor",
  "904": "SamplePeriodDayFrc factor in the annotation index, AnnotationMatchPrediction factor",
  "905": "OneClick factor in the annotation index, QueryMatchPrediction factor",
  "906": "OneClick factor in the annotation index, AnnotationMatchPrediction factor",
  "907": "OneClick factor in the annotation index, factor Bm15AK4",
  "908": "OneClick factor in the annotation index, factor BocmWeightedW1K3",
  "909": "LongClick factor in the annotation index, QueryMatchPrediction factor",
  "910": "LongClick factor in the annotation index, AnnotationMatchPrediction factor",
  "911": "LongClick factor in the annotation index, factor Bm15AK4",
  "912": "LongClick factor in the annotation index, factor BocmWeightedW1K3",
  "913": "SplitDwellTime factor in the annotation index, QueryMatchPrediction factor",
  "914": "SplitDwellTime factor in the annotation index, AnnotationMatchPrediction factor",
  "915": "BQPR factor in the annotation index, QueryMatchPrediction factor",
  "916": "BQPR factor in the annotation index, AnnotationMatchPrediction factor",
  "917": "YabarVisits factor in the annotation index, QueryMatchPrediction factor",
  "918": "YabarVisits factor in the annotation index, AnnotationMatchPrediction factor",
  "919": "YabarTime factor in the annotation index, QueryMatchPrediction factor",
  "920": "YabarTime factor in the annotation index, AnnotationMatchPrediction factor",
  "921": "SimpleClick factor in the annotation index, QueryMatchPrediction factor",
  "922": "SimpleClick factor in the annotation index, AnnotationMatchPrediction factor",
  "923": "LongClick factor in the annotation index, BocmPlain factor",
  "924": "Collaborative filtering result for factor FI_DBM35 from random log in annotation index, FullMatchPrediction factor",
  "925": "Collaborative filtering result for factor FI_DBM35 from random log in the annotation index, factor AnnotationMatchPrediction",
  "926": "OneClick factor in the annotation index, SynonymMatchPrediction factor",
  "927": "OneClick factor in the annotation index, FullMatchPrediction factor",
  "928": "OneClick factor in the annotation index, ValueWcmAvg factor",
  "929": "OneClick factor in the annotation index, BocmWeightedMaxK1 factor",
  "930": "OneClick factor in the annotation index, factor Bm15StrictK2",
  "931": "OneClick factor in the annotation index, factor Bm15MaxK3",
  "932": "OneClick factor in the annotation index, factor BclmPlainW1K3",
  "933": "OneClick factor in the annotation index, ValueWcmMax factor",
  "934": "OneClick factor in the annotation index, ValueWcmPrediction factor",
  "935": "OneClick factor in the annotation index, BclmWeightedK3 factor",
  "936": "BQPR factor in the annotation index, factor BocmWeightedW1K3",
  "937": "BQPR factor in the annotation index, factor Bm15StrictK2",
  "938": "SplitDwellTime factor in the annotation index, factor BocmWeightedMaxK1",
  "939": "SplitDwellTime factor in the annotation index, FullMatchPrediction factor",
  "940": "SplitDwellTime factor in the annotation index, ValueWcmAvg factor",
  "941": "CorrectedCtrReg factor in the annotation index, factor Bm15StrictK2",
  "942": "Predicting the proportion of queries with geography by the bag of words built for a query",
  "943": "The query is a url to the exact point and space characters - the wizard's isurl rule is used",
  "944": "Collaborative filtering result for factor FI_DBM35 from random log in annotation index, factor ValueWcmMax",
  "945": "Collaborative filtering result for factor FI_DBM35 from random log in the annotation index, factor ValueWcmAvg",
  "946": "Collaborative filtering result for factor FI_DBM35 from random log in annotation index, factor Bm15StrictK2",
  "947": "Collaborative filtering result for factor FI_DBM35 from random log in the annotation index, factor BclmPlainW1K3",
  "948": "Collaborative filtering result for factor FI_DBM35 from random log in annotation index, factor BclmWeightedK3",
  "949": "Collaborative filtering result for factor FI_DBM35 from random log in annotation index, factor BocmWeightedW1K3",
  "950": "CorrectedCtrXfactor in the annotation index, AnnotationMatchPrediction factor",
  "951": "CorrectedCtrXfactor in the annotation index, QueryMatchPrediction factor",
  "952": "CorrectedCtrXfactor in the annotation index, ValueWcmMax factor",
  "953": "CorrectedCtrXfactor in the annotation index, ValueWcmAvg factor",
  "954": "CorrectedCtrXfactor in the annotation index, BocmWeightedW1K3 factor",
  "955": "CorrectedCtrXfactor in the annotation index, factor BclmPlainK3",
  "956": "CorrectedCtrXfactor in the annotation index, factor BclmMixPlainW1K1",
  "957": "Predicting the total timestamp to the end of the session if this request-document pair is implemented",
  "958": "Predicting the contribution of this query-document pair to the timespan",
  "959": "SamplePeriodDayFrc factor in the annotation index, ValueWcmAvg factor",
  "960": "SamplePeriodDayFrc factor in the annotation index, factor Bm15MaxK3",
  "961": "SamplePeriodDayFrc factor in the annotation index, factor BocmWeightedK3",
  "962": "SamplePeriodDayFrc factor in the annotation index, factor BocmDoubleK5",
  "963": "SplitDwellTime factor in the annotation index, factor Bm15MaxK3",
  "964": "SimpleClick factor in the annotation index, factor BclmWeightedK3",
  "965": "Predicting the percentage of track length that will be played if this request-track pair is implemented",
  "966": "The probability that the region predicted by the yweb/robot/urlgeo_ml model is correct, assuming the predicted city",
  "967": "PopularSEFRCBrowser factor in the annotation index, AnnotationMatchPrediction factor",
  "968": "PopularSEFRCBrowser factor in the annotation index, SynonymMatchPrediction factor",
  "969": "PopularSEFRCBrowser factor in annotation index, ValueWcmPrediction factor",
  "970": "PopularSEFRCBrowser factor in the annotation index, factor BclmWeightedV2K3",
  "971": "PopularSEFRCBrowser factor in the annotation index, factor BclmMixPlainW1K1",
  "972": "Calculated by the link index. Max(sum(idf)) over all links that are subsets of query / sum(idf) for query",
  "973": "OneClick factor in the annotation index, AnnotationMatchPredictionWeighted factor",
  "974": "LongClick factor in the annotation index, AnnotationMatchPredictionWeighted factor",
  "975": "YabarTime factor in the annotation index, AnnotationMatchPredictionWeighted factor",
  "976": "Equals one if the page connects the js-api of any geo-data provider",
  "977": "LongClickSamplePeriod factor in the annotation index, AnnotationMatchPrediction factor",
  "978": "LongClickSamplePeriod factor in the annotation index, QueryMatchPrediction factor",
  "979": "LongClickSamplePeriod factor in the annotation index, ValueWcmAvg factor",
  "980": "LongClickSamplePeriod factor in the annotation index, ValueWcmPrediction factor",
  "981": "LongClickSamplePeriod factor in the annotation index, factor BclmPlainW1K3",
  "982": "LongClickSamplePeriod factor in the annotation index, factor BclmWeightedK3",
  "983": "LongClickSamplePeriod factor in the annotation index, factor BocmWeightedW1K3",
  "984": "LongClickSamplePeriod factor in the annotation index, factor BclmPlainK5",
  "985": "LongClickSamplePeriod factor in the annotation index, factor BclmWeightedV2K3",
  "986": "LongClickSamplePeriod factor in the annotation index, factor BocmDoubleK5",
  "987": "LongClickSamplePeriod factor in the annotation index, factor Bm15StrictK2",
  "988": "Normalized corrected clicks maximum ratio by query with user's city(gc=) mentioned equal by region",
  "989": "Normalized corrected clicks maximum ratio by query with user's city(gc=) mentioned equal to user's region",
  "990": "BQPR on the sampled period. Annotation Index. Factor WcmCoverageMax",
  "991": "BQPR on the sampled period. Annotation Index. FullMatchPrediction Factor",
  "992": "BQPR on the sampled period. Annotation Index. Factor AnnotationMatchPredictionWeighted",
  "993": "BQPR on the sampled period. Abstract Index. Factor ValuePcmAvg",
  "994": "BQPR on the sampled period. Abstract Index. Factor ValueWcmAvg",
  "995": "BQPR on the sampled period. Abstract Index. Factor Bm15V4K8",
  "996": "BQPR on the sampled period. Abstract Index. Factor BocmWeightedV4K8",
  "997": "BQPR on the sampled period. Annotation Index. SampleWcmMax factor",
  "998": "BQPR on the sampled period. Annotation Index. SynonymMatchPrediction factor",
  "999": "BQPR on the sampled period. Annotation Index. AnnotationMatchPrediction factor",
  "1000": "BQPR on the sampled period. Annotation Index. Factor SuffixMatchCount",
  "1001": "BQPR on the sampled period. Annotation Index. Factor WcmCoveragePrediction",
  "1002": "DoubleFrc in the annotation index, FullMatchPrediction factor",
  "1003": "DoubleFrc in the annotation index, SynonymMatchPrediction factor",
  "1004": "DoubleFrc in the annotation index, AnnotationMatchPrediction factor",
  "1005": "DoubleFrc in the annotation index, AnnotationMatchPredictionWeighted factor",
  "1006": "DoubleFrc in the annotation index, QueryMatchPrediction factor",
  "1007": "DoubleFrc in the annotation index, ValueWcmAvg factor",
  "1008": "DoubleFrc in the annotation index, factor BocmWeightedMaxK1",
  "1009": "DoubleFrc in the annotation index, factor Bm15V4K5",
  "1010": "DoubleFrc in the annotation index, factor BocmWeightedV4K5",
  "1011": "DoubleFrc in the annotation index, factor BocmDoubleK1",
  "1024": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: minimum extension weight.",
  "1025": "Linguistic Boosting Factor. Type of extensions: XfDtShow. Factor: Bm15 by stream group 2. Maximum value of the factor by extensions.",
  "1026": "Linguistic Boosting Factor. Type of extensions: XfDtShow. Factor: BclmWeightedFLogW0 by stream group 3. Maximum value of the factor by extensions.",
  "1027": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: Bm15FLogW0 by url and title. Maximal value of the factor by extensions.",
  "1028": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: CosineMaxMatchPrediction by text and title. Maximal value of the factor by extensions.",
  "1029": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: Bm15 by url. Maximal value of the factor by extensions.",
  "1030": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: FullMatchValue by stream LongClickSP. Maximum weighted value of the factor by extensions.",
  "1031": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: FullMatchValue by OneClick stream. Maximum weighted value of the factor by extensions.",
  "1032": "Linguistic Boosting Factor. Type of extensions: XfDtShow. Factor: Bm15FLog by stream group 1. Weighted average of the factor values multiplied by the weight (\\\\frac{\\\\Sum W_i * (W_i * F_i)}{\\\\Sum W_i}) by extensions.",
  "1033": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: Bm15FLogW0 by url and title. Weighted average of factor values multiplied by weight (\\\\frac{\\\\\\Sum W_i * (W_i * F_i)}{\\\\Sum W_i}) by extensions.",
  "1034": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: MinWindowSize by text. Weighted average of the factor values by extensions.",
  "1035": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: mesh OriginalRequestFractionExact by streamer group for mesh factors (text, title, annotation streamers).",
  "1036": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: Bagging CosineMaxMatchPrediction by Streaming LongClickSP.",
  "1037": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: bag CosineMatchWeightedValue by Stream LongClickSP.",
  "1038": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: Bag AnnotationMatchAvgValue by Stream SimpleClick.",
  "1039": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: bag CosineMaxMatcg by Title.",
  "1040": "Linguistic Boosting Factor. Type of extensions: XfDtShow. Factor: BclmWeightedFLogW0 by stream group 3. Minimum weighted value of the factor by extension top.",
  "1041": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: AnnotationMatchWeightedValue by stream LongClickSP. Minimum weighted value of the factor by extension top.",
  "1042": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: AnnotationMatchWeightedValue by stream LongClickSP. Minimum weighted value of the factor on the extension top normalized to the maximum weight on the extension top.",
  "1043": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: Chain0WCM by text. Weighted average of the factor values multiplied by the weight (\\\\frac{\\\\Sum W_i * (W_i * F_i)}{\\\\Sum W_i}) of the extension top.",
  "1044": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: FullMatchValue by stream LongClickSP. Weighted average of the factor values multiplied by the weight (\\\\frac{\\\\Sum W_i * (W_i * F_i)}{\\\\Sum W_i}) of the extension top.",
  "1045": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: FullMatchValue by Stream OneClick. Weighted average of the factor values multiplied by the weight (\\\\frac{\\\\Sum W_i * (W_i * F_i)}{\\\\Sum W_i}) of the extension top.",
  "1046": "Linguistic Boosting Factor. Type of extensions: XfDtShow. Factor: BclmWeightedFLogW0 by stream group 3. Weighted average of the factor values by the extension top.",
  "1047": "OneClickFrc counted by the sampled period and collaboratively extended, FullMatchPrediction factor",
  "1048": "OneClickFrc counted by the sampled period and collaboratively extended, AnnotationMatchPredictionWeighted factor",
  "1049": "OneClickFrc calculated from the sampled period and collaboratively extended, ValueWcmAvg factor",
  "1050": "OneClickFrc calculated from the sampled period and collaboratively extended, WcmMax factor",
  "1051": "OneClickFrc calculated from the sampled period and collaboratively extended, WcmCoveragePrediction factor",
  "1052": "OneClickFrc calculated from the sampled period and collaboratively extended, WcmCoverageMax factor",
  "1053": "OneClickFrc calculated from the sampled period and collaboratively extended, PcmMax factor",
  "1054": "OneClickFrc counted by the sampled period and collaboratively extended, PrefixMatchCount factor",
  "1055": "OneClickFrc counted by the sampled period and collaboratively extended, SuffixMatchCount factor",
  "1056": "OneClickFrc calculated from the sampled period and collaboratively extended, factor Bm15V0W1K1",
  "1057": "The meaning of the locality classifier for the query",
  "1058": "relev_local == ru",
  "1059": "relev_local == ua",
  "1060": "relev_local == by",
  "1061": "relev_local == kz",
  "1062": "local_report == tr",
  "1063": "relev_locale == world",
  "1064": "Porn query classification result from Wizard (iad_vw flag, based on Vowpal Wabbit)",
  "1065": "Covering URLs with trigrams from query. Analogue of UrlDomainFraction,UrlPathAndParamsFraction factors.",
  "1066": "QueryDwellTime, FullMatchPrediction factor",
  "1067": "QueryDwellTime, SynonymMatchPrediction factor",
  "1068": "QueryDwellTime, factor AnnotationMatchPrediction",
  "1069": "QueryDwellTime, фактор AnnotationMatchPredictionWeighted",
  "1070": "QueryDwellTime, QueryMatchPrediction factor",
  "1071": "QueryDwellTime, ValueWcmAvg factor",
  "1072": "QueryDwellTime, factor BclmPlainW1K3",
  "1073": "QueryDwellTime, factor Bm15CoverageV4K3",
  "1074": "QueryDwellTime, factor BclmPlainK4",
  "1075": "QueryDwellTime, factor BocmWeightedV4K5",
  "1076": "Percentage of visits, for which the dwell time during the day on the host is more than 90 sec.",
  "1077": "Percentage of visits, for which the time during the day on the host is more than 160 sec",
  "1078": "Rank of hacked sites",
  "1079": "Morning ags4",
  "1080": "Maximum QsRank on the owner",
  "1081": "Average QsRank on the main domain",
  "1082": "Percentage of users returning within a month",
  "1083": "Number of users who returned during the month",
  "1084": "Dorway Rank",
  "1085": "Share of capital letters in Title",
  "1086": "Share of incoming traffic from search engines among all incoming traffic",
  "1087": "Share of direct visits among all incoming traffic",
  "1088": "Average QsRank in the sliding window",
  "1089": "Minimum QsRank",
  "1090": "Medium Hops",
  "1091": "Bm15K01 factor over hits from Url",
  "1092": "Bm15K01 factor over hits from Title",
  "1093": "Bocm15K001 factor over hits from Title",
  "1094": "Bm11Norm16384 factor over hits from Text",
  "1095": "Bocm11Norm256 factor over hits from Text",
  "1096": "CosineMatchMaxPrediction factor over hits from Text",
  "1097": "Bm15FLogK0001 factor over hits from FieldSet1 stream",
  "1098": "Bm15FLogK0001 factor over hits from FieldSet2 stream",
  "1099": "BclmWeightedFLogW0K0001 factor over hits from FieldSet3 stream",
  "1100": "Bm15FLogW0K00001 factor over hits from FieldSetUT stream",
  "1101": "Chain0Wcm factor over hits from Body",
  "1102": "PairMinProximity factor over hits from Body",
  "1103": "MinWindowSize factor over hits from Body",
  "1104": "CosineMatchMaxPrediction factor over hits from PopularSeFrcBrowser stream",
  "1105": "MixMatchWeightedValue factor over hits from DoubleFrc stream",
  "1106": "AnnotationMaxValueWeighted factor over hits from DoubleFrc stream",
  "1107": "AnnotationMaxValue factor over hits from DoubleFrc stream",
  "1108": "AnnotationMatchWeightedValue factor over hits from DoubleFrc stream",
  "1109": "AllWcmWeightedValue factor over hits from DoubleFrc stream",
  "1110": "AllWcmMatch95AvgValue factor over hits from DoubleFrc stream",
  "1111": "AllWcmWeightedPrediction factor over hits from DoubleFrc stream",
  "1112": "AllWcmMatch80AvgValue factor over hits from DoubleFrc stream",
  "1113": "FullMatchValue factor over hits from DoubleFrc stream",
  "1114": "FullMatchAnyValue factor over hits from DoubleFrc stream",
  "1115": "ExactQueryMatchAvgValue factor over hits from DoubleFrc stream",
  "1116": "BclmMixPlainKE5 factor over hits from OneClickFrcXfSp stream",
  "1117": "Bm15StrictAnnotationK01 factor over hits from OneClickFrcXfSp stream",
  "1118": "AllWcmWeightedValue factor over hits from OneClickFrcXfSp stream",
  "1119": "AllWcmWeightedPrediction factor over hits from OneClickFrcXfSp stream",
  "1120": "AllWcmMatch80AvgValue factor over hits from OneClickFrcXfSp stream",
  "1121": "MixMatchWeightedValue factor over hits from OneClickFrcXfSp stream",
  "1122": "AnnotationMatchWeightedValue factor over hits from OneClickFrcXfSp stream",
  "1123": "BclmPlaneProximity1Bm15W0Size1K0001 factor over hits from OneClickFrcXfSp stream",
  "1124": "BclmWeightedProximity1Bm15Size1K001 factor over hits from OneClickFrcXfSp stream",
  "1125": "BclmMixPlainKE5 factor over hits from BQPRSample stream",
  "1126": "AllWcmWeightedValue factor over hits from BQPRSample stream",
  "1127": "AllWcmWeightedPrediction factor over hits from BQPRSample stream",
  "1128": "AllWcmMaxPrediction factor over hits from BQPRSample stream",
  "1129": "AllWcmMatch80AvgValue factor over hits from BQPRSample stream",
  "1130": "MixMatchWeightedValue factor over hits from BQPRSample stream",
  "1131": "CosineMatchMaxPrediction factor over hits from BQPRSample stream",
  "1132": "AnnotationMaxValueWeighted factor over hits from BQPRSample stream",
  "1133": "AnnotationMaxValue factor over hits from BQPRSample stream",
  "1134": "AnnotationMatchWeightedValue factor over hits from BQPRSample stream",
  "1135": "Bocm15K001 factor over hits from BQPRSample stream",
  "1136": "BclmPlaneProximity1Bm15W0Size1K0001 factor over hits from BQPRSample stream",
  "1137": "BclmWeightedProximity1Bm15Size1K001 factor over hits from BQPRSample stream",
  "1138": "BclmPlaneProximity1Bm15W0Size1K0001 factor over hits from LongClickSP stream",
  "1139": "Bm15MaxAnnotationK001 factor over hits from LongClickSP stream",
  "1140": "FullMatchValue factor over hits from LongClickSP stream",
  "1141": "MixMatchWeightedValue factor over hits from LongClickSP stream",
  "1142": "CosineMatchMaxPrediction factor over hits from LongClickSP stream",
  "1143": "AnnotationMaxValue factor over hits from LongClickSP stream",
  "1144": "AnnotationMaxValueWeighted factor over hits from LongClickSP stream",
  "1145": "AnnotationMatchWeightedValue factor over hits from LongClickSP stream",
  "1146": "AllWcmMatch95AvgValue factor over hits from LongClickSP stream",
  "1147": "AllWcmWeightedValue factor over hits from LongClickSP stream",
  "1148": "AllWcmMaxMatch factor over hits from LongClickSP stream",
  "1149": "AllWcmWeightedPrediction factor over hits from LongClickSP stream",
  "1150": "Bocm15K001 factor over hits from LongClickSP stream",
  "1151": "QueryPrefixMatchOriginalWordValue factor over hits from LongClickSP stream",
  "1152": "BclmPlaneProximity1Bm15W0Size1K0001 factor over hits from SamplePeriodDayFrc stream",
  "1153": "AttenV1Bm15K05 factor over hits from SamplePeriodDayFrc stream",
  "1154": "FullMatchValue factor over hits from SamplePeriodDayFrc stream",
  "1155": "FullMatchAnyValue factor over hits from SamplePeriodDayFrc stream",
  "1156": "AllWcmWeightedValue factor over hits from SamplePeriodDayFrc stream",
  "1157": "AllWcmWeightedPrediction factor over hits from SamplePeriodDayFrc stream",
  "1158": "AllWcmMatch95AvgValue factor over hits from SamplePeriodDayFrc stream",
  "1159": "AllWcmMatch80AvgValue factor over hits from SamplePeriodDayFrc stream",
  "1160": "MixMatchWeightedValue factor over hits from SamplePeriodDayFrc stream",
  "1161": "AnnotationMatchWeightedValue factor over hits from SamplePeriodDayFrc stream",
  "1162": "AnnotationMaxValue factor over hits from SamplePeriodDayFrc stream",
  "1163": "AnnotationMaxValueWeighted factor over hits from SamplePeriodDayFrc stream",
  "1164": "Bocm15K001 factor over hits from SamplePeriodDayFrc stream",
  "1165": "AllWcmWeightedValue factor over hits from CorrectedCtrXFactor stream",
  "1166": "AllWcmMaxPrediction factor over hits from CorrectedCtrXFactor stream",
  "1167": "AllWcmWeightedPrediction factor over hits from CorrectedCtrXFactor stream",
  "1168": "AllWcmMatch80AvgValue factor over hits from CorrectedCtrXFactor stream",
  "1169": "MixMatchWeightedValue factor over hits from CorrectedCtrXFactor stream",
  "1170": "AnnotationMatchWeightedValue factor over hits from CorrectedCtrXFactor stream",
  "1171": "BclmPlaneProximity1Bm15W0Size1K001 factor over hits from CorrectedCtrXFactor stream",
  "1172": "BclmWeightedProximity1Bm15Size1K001 factor over hits from CorrectedCtrXFactor stream",
  "1173": "AllWcmMaxPrediction factor over hits from LongClick stream",
  "1174": "MixMatchWeightedValue factor over hits from LongClick stream",
  "1175": "AnnotationMaxValueWeighted factor over hits from LongClick stream",
  "1176": "FullMatchValue factor over hits from LongClick stream",
  "1177": "AnnotationMatchWeightedValue factor over hits from LongClick stream",
  "1178": "AllWcmWeightedValue factor over hits from SimpleClick stream",
  "1179": "AllWcmWeightedPrediction factor over hits from SimpleClick stream",
  "1180": "AllWcmMaxPrediction factor over hits from SimpleClick stream",
  "1181": "MixMatchWeightedValue factor over hits from SimpleClick stream",
  "1182": "AnnotationMatchWeightedValue factor over hits from SimpleClick stream",
  "1183": "AnnotationMaxValueWeighted factor over hits from BrowserPageRank stream",
  "1184": "AnnotationMatchWeightedValue factor over hits from BrowserPageRank stream",
  "1185": "AnnotationMaxValue factor over hits from BrowserPageRank stream",
  "1186": "Bocm15K001 factor over hits from BrowserPageRank stream",
  "1187": "MixMatchWeightedValue factor over hits from OneClick stream",
  "1188": "FullMatchValue factor over hits from OneClick stream",
  "1189": "AnnotationMatchWeightedValue factor over hits from OneClick stream",
  "1190": "AllWcmWeightedPrediction factor over hits from SplitDwellTime stream",
  "1191": "Bm15MaxAnnotationK001 factor over hits from SplitDwellTime stream",
  "1192": "BclmWeightedProximity1Bm15Size1K0001 factor over hits from QueryDwellTime stream",
  "1193": "AttenV1Bm15K001 factor over hits from QueryDwellTime stream",
  "1194": "MixMatchWeightedValue factor over hits from QueryDwellTime stream",
  "1195": "AnnotationMaxValueWeighted factor over hits from QueryDwellTime stream",
  "1196": "AnnotationMaxValue factor over hits from QueryDwellTime stream",
  "1197": "AnnotationMatchWeightedValue factor over hits from QueryDwellTime stream",
  "1198": "AllWcmWeightedValue factor over hits from QueryDwellTime stream",
  "1199": "AllWcmMatch80AvgValue factor over hits from QueryDwellTime stream",
  "1200": "BclmPlaneProximity1Bm15W0Size1K0001 factor over hits from RandomLogDBM35 stream",
  "1201": "Bm15StrictAnnotationK001 factor over hits from RandomLogDBM35 stream",
  "1202": "MixMatchWeightedValue factor over hits from RandomLogDBM35 stream",
  "1203": "AnnotationMaxValueWeighted factor over hits from RandomLogDBM35 stream",
  "1204": "AnnotationMatchWeightedValue factor over hits from RandomLogDBM35 stream",
  "1205": "AllWcmWeightedValue factor over hits from RandomLogDBM35 stream",
  "1206": "FullMatchValue factor over hits from RandomLogDBM35 stream",
  "1207": "ExactQueryMatchAvgValue factor over hits from RandomLogDBM35 stream",
  "1208": "relev_local == id",
  "1209": "Binary factor about the mobile adaptability of the document. Taken from erf",
  "1210": "In cases where FI_NATIONAL_DOMAIN is 0 and herf.NationalDomainId is full, put 1",
  "1211": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: MixMatchWeightedValue by stream QueryDwellTime. Maximum weighted value of the factor by extensions.",
  "1212": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: MixMatchWeightedValue by stream QueryDwellTime. Weighted average value of the factor by extensions.",
  "1213": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: MixMatchWeightedValue by stream QueryDwellTime. Minimum weighted value of the factor by extension top.",
  "1214": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: AnnotationMatchWeightedValue by stream QueryDwellTime. Minimum weighted value of the factor by extension top.",
  "1215": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: AnnotationMatchWeightedValue by stream QueryDwellTime. Maximum weighted value of the factor by extensions.",
  "1216": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: AllWcmMatch95AvgValue by stream QueryDwellTime. Weighted average value of the factor by extension top.",
  "1217": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: MixMatchWeightedValue by stream BQPRSample. Maximum weighted value of the factor by extensions.",
  "1218": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: MixMatchWeightedValue by Stream DoubleFrc. Maximum weighted value of the factor by extensions.",
  "1219": "DSSM model trained on clicks.",
  "1220": "DSSM model trained on clicks.",
  "1221": "DSSM model trained on clicks.",
  "1222": "DSSM model trained on clicks.",
  "1223": "DSSM model trained on clicks.",
  "1224": "DSSM model trained on clicks.",
  "1225": "DSSM model trained on clicks.",
  "1226": "DSSM model trained on clicks.",
  "1227": "Neural model of content quality for medical topics",
  "1228": "request came from yandsearch (rearr.is_desktop == 1)",
  "1229": "request came from touchsearch (rearr.is_mobile == 1)",
  "1230": "request came from padsearch (rearr.is_tablet == 1)",
  "1231": "request came from device with Android OS (rearr.dd_osfamily == Android)",
  "1232": "request came from device with iOS (rearr.dd_osfamily == iOS)",
  "1233": "request came from device with Windows OS (rearr.dd_osfamily == Windows)",
  "1234": "request does not come from devices with Android, iOS or Windows OS (rearr.dd_osfamily != [Android, iOS, Windows])",
  "1235": "A broken embedded video on the page.",
  "1236": "FullMatchValue factor over hits from CorrectedCtrLongPeriod stream",
  "1237": "MixMatchWeightedValue factor over hits from CorrectedCtrLongPeriod stream",
  "1238": "AnnotationMaxValueWeighted factor over hits from CorrectedCtrLongPeriod stream",
  "1239": "AnnotationMatchWeightedValue factor over hits from CorrectedCtrLongPeriod stream",
  "1240": "AllWcmMatch95AvgValue factor over hits from CorrectedCtrLongPeriod stream",
  "1241": "AllWcmMatch80AvgValue factor over hits from CorrectedCtrLongPeriod stream",
  "1242": "AllWcmWeightedValue factor over hits from CorrectedCtrLongPeriod stream",
  "1243": "AllWcmWeightedPrediction factor over hits from CorrectedCtrLongPeriod stream",
  "1244": "Neural model of content quality for medical topics (for exponents)",
  "1245": "BclmMixPlainKE5 factor over hits from NHopSumDwellTime stream",
  "1246": "Match80AvgValue factor over hits from NHopSumDwellTime stream",
  "1247": "Neural model of content quality for financial and legal topics",
  "1248": "MixMatchWeightedValue factor over hits from NHopSumDwellTime stream",
  "1249": "Neural model of content quality for financial and legal topics (for exponents)",
  "1250": "BclmMixPlainKE5 factor over hits from FirstClickDtXf stream",
  "1251": "FullMatchValue factor over hits from FirstClickDtXf stream",
  "1252": "AnnotationMaxValueWeighted factor over hits from FirstClickDtXf stream",
  "1253": "AnnotationMatchWeightedValue factor over hits from FirstClickDtXf stream",
  "1254": "BclmPlaneProximity1Bm15W0Size1K001 factor over hits from FirstClickDtXf stream",
  "1255": "Linguistic Boosting Factor. Type of extensions: RequestWithRegionName. Bm11 by document text and title",
  "1256": "Linguistic Boosting Factor. Type of extensions: RequestWithRegionName. CosineMatchMaxPrediction by document text and title",
  "1257": "Linguistic Boosting Factor. Extension type: RequestWithRegionName. Factor: AnnotationMatchWeightedValue by Stream LongClick.",
  "1258": "Linguistic Boosting Factor. Extension type: RequestWithRegionName. Factor: FullMatchValue by Stream OneClick.",
  "1259": "Linguistic Boosting Factor. Extension type: RequestWithRegionName. Factor: AnnotationMatchValue by Stream OneClick.",
  "1260": "Linguistic Boosting Factor. Extension type: RequestWithRegionName. Factor: AnnotationMatchWeightedValue by stream LongClickSP.",
  "1261": "Linguistic Boosting Factor. Extension type: RequestWithRegionName. Factor: FullMatchValue by stream LongClickSP.",
  "1262": "Linguistic Boosting Factor. Extension type: RequestWithRegionName. Factor: AnnotationMaxValueWeighted by Stream BQPRSample.",
  "1263": "Linguistic Boosting Factor. Extension type: RequestWithRegionName. Factor: Bm15 by stream group 1.",
  "1264": "Linguistic Boosting Factor. Extension type: RequestWithRegionName. Factor: Bm15 by stream group 2.",
  "1265": "Linguistic Boosting Factor. Extension type: RequestWithRegionName. Factor: BclmWeightedFLogW0 by Streaming Group 3.",
  "1266": "Linguistic Boosting Factor. Extension type: RequestWithRegionName. Chain0Wcm factor by document text",
  "1267": "Random float in [0,1] by user request and document",
  "1268": "Neural model of content quality for sos topics",
  "1269": "the ratio of the total area of all Flash blocks to the screen area",
  "1270": "Neural model of content quality for sos topics (for expos)",
  "1271": "Copy of old version No.294 factor. Added for use on L3 stage only. Coverage of the domain with three letters from the query. (Chelyabinsk lottery - chelloto. Translate query into transliteration, find three-letter words that are covered (che, hel, lot, olo), see what proportion of all three letters are covered)",
  "1272": "Fast version of FI_URL_DOMAIN_FRACTION",
  "1273": "Prediction of the session timestamp subject to the implementation of this query-document pair",
  "1274": "Request-document dssm that predicts document sobriety",
  "1275": "The document is a selection from the /tag ticktock",
  "1276": "The document is a selection from the /discovery tiktok",
  "1277": "The document is a selection from the /music tiktok",
  "1278": "The request-document model of synsig.",
  "1279": "Factor on the original query. Calculated using tokenized url. CosineMatchMaxPrediction algorithm.",
  "1280": "Factor on the original query. Calculated by tokenized url. Weight of the hit is multiplied by 1/ (1 + position of the word in the sentence) Algorithm of word weights aggregation: Bm15. The normalization coefficient is 0.5.",
  "1281": "Factor by original request. It is counted by document title. The word weights aggregation algorithm is BclmMixPlain: a linear mixture of annotation Bclm weight and weighted Positionless word weight, then word counters are aggregated through bm15. The normalization factor is 10^(-5).",
  "1282": "Factor by original request. It is counted from the title of the document. CMMatchTop5AvgMatchValue algorithm.",
  "1283": "Factor by original request. It is counted by the title of the document. Degree of query word coverage with exact form (without synonyms).",
  "1284": "Factor by original request. It is counted by the title of the document. Weight of the hit is multiplied by 1/ (1 + position of the word in the sentence) Algorithm of word weights aggregation: Bm15. Normalization coefficient 0.5.",
  "1285": "Factor in the original request. It is counted by the content of the document. The word weights aggregation algorithm is BclmMixPlain: a linear mixture of annotation Bclm weight and weighted Positionless word weight, then word counters are aggregated through bm15. The normalization factor is 10^(-5).",
  "1286": "Factor in the original request. It is calculated from the contents of the document. CosineMatchMaxPrediction algorithm.",
  "1287": "Factor in the original request. Calculated from the contents of the document. AllWcmWeightedPrediction algorithm.",
  "1288": "Factor in the original request. It is counted by the content of the document. Algorithm of word weights aggregation Bocm15. The normalization coefficient is 0.01.",
  "1289": "Factor in the original request. It is counted by the contents of the document. Algorithm: QueryPartMatchSumValueAny.",
  "1290": "Factor in the original request. It is counted by the content of the document. Degree of query word coverage with exact form (without synonyms).",
  "1291": "Factor in the original request. It is counted by the content of the document. The degree of coverage of the query words in the exact form.",
  "1292": "Factor in the original request. It is counted by the content of the document. Scale Aggregation Algorithm: Bm15MaxAnnotation Normalization Factor 0.01.",
  "1295": "Url is a channel/post from a verified social network account",
  "1296": "Dssm, predicting whether a site is a mimicry",
  "1299": "MetaPolyGen8",
  "1300": "CMMatch80AvgValue factor over hits from QueryDwellTime stream",
  "1301": "CMMatchTop5AvgMatch factor over hits from DoubleFrc stream",
  "1302": "PerWordCMMaxMatchMin factor over hits from OneClickFrcXfSp stream",
  "1303": "PerWordCMMaxMatchMin factor over hits from FirstClickDtXf stream",
  "1304": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: PerWordCMMaxMatchMin by stream LongClickSP. Maximum weighted value of the factor by extensions.",
  "1305": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: PerWordCMMaxMatchMin by Stream OneClick. Maximum weighted value of the factor by extensions.",
  "1306": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: PerWordCMMaxMatchMin by stream FirstClickDtXf. Minimum weighted value of the factor by extension top.",
  "1309": "Distance from the city from which the request was made to Ankara",
  "1310": "Distance from the city where the request was made to Magadan",
  "1311": "Geographical latitude of the city from where the request was made",
  "1312": "Geographical longitude of the city from where the query was made",
  "1313": "FullMatchValue factor over hits from LongClick stream (Mobile sessions filtered)",
  "1314": "CosineMatchMaxPrediction factor over hits from LongClick stream (Mobile sessions filtered)",
  "1315": "AnnotationMatchWeightedValue factor over hits from LongClick stream (Mobile sessions filtered)",
  "1316": "AllWcmMatch95AvgValue factor over hits from LongClick stream (Mobile sessions filtered)",
  "1317": "AllWcmWeightedValue factor over hits from LongClick stream (Mobile sessions filtered)",
  "1318": "AllWcmWeightedPrediction factor over hits from LongClick stream (Mobile sessions filtered)",
  "1319": "CMMatchTop5AvgValue factor over hits from LongClick stream (Mobile sessions filtered)",
  "1320": "Bm15MaxAnnotationK001 factor over hits from LongClick stream (Mobile sessions filtered)",
  "1321": "Linguistic Boosting Factor. Extension type: XfDtShow. Factor: PerWordCMMaxMatchMin on incoming links. Maximum weighted value of the factor by extensions.",
  "1324": "Static URL factor by search sessions for 1600 days. Normal Ctr.",
  "1325": "Static URL factor by search sessions over 1600 days. Average DwellTime, and DwellTime from session is truncated if more than 3600 seconds",
  "1327": "Static URL factor by search sessions over 1600 days. Average DwellTime, and DwellTime from session is truncated if more than 180 seconds",
  "1328": "Static URL factor by search sessions for 1600 days.  Probability that the click on the URL will be more than 120 seconds",
  "1329": "Static URL factor by search sessions for 1600 days. Logarithm of the number of hits.",
  "1331": "Static URL factor by search sessions over 1600 days. The probability that the URL will be clicked if at least one URL is not clicked is higher.",
  "1332": "Static URL factor by search sessions over 1600 days. The probability that the URL will not be clicked if at least one URL is clicked is lower.",
  "1333": "Static URL factor by search sessions for 1600 days. Normal Ctr. Localization to country level.",
  "1334": "Static URL factor by search sessions over 1600 days. Average DwellTime, with DwellTime from session truncated if more than 3600 seconds. Localization to country level.",
  "1335": "Static URL factor by search sessions for 1600 days. The probability that the click on the URL will be more than 120 seconds. Localization to country level.",
  "1336": "Static URL factor by search sessions for 1600 days. Average URL position for all queries. Localization to the country level.",
  "1337": "Static URL factor by search sessions for 1600 days. Logarithm of the number of impressions. Localization to the country level.",
  "1338": "DSSM model trained on clicks. Takes bigrams into account.",
  "1339": "MixMatchWeightedValue factor over hits from FirstLastClick stream (Mobile sessions filtered)",
  "1340": "CosineMatchMaxPrediction factor over hits from FirstLastClick stream (Mobile sessions filtered)",
  "1341": "FullMatchValue factor over hits from FirstLastClick stream (Mobile sessions filtered)",
  "1342": "AllWcmMatch95AvgValue factor over hits from FirstLastClick stream (Mobile sessions filtered)",
  "1343": "CMMatchTop5AvgValue factor over hits from FirstLastClick stream (Mobile sessions filtered)",
  "1344": "AllWcmWeightedValue factor over hits from FirstLastClick stream (Mobile sessions filtered)",
  "1345": "Was the request made by voice",
  "1346": "AllWcmWeightedValue factor over hits from AvgDTWeightedByRankMobile stream (Mobile sessions filtered)",
  "1347": "AllWcmMatch95AvgValue factor over hits from AvgDTWeightedByRankMobile stream (Mobile sessions filtered)",
  "1348": "CMMatchTop5AvgValue factor over hits from AvgDTWeightedByRankMobile stream (Mobile sessions filtered)",
  "1349": "AnnotationMatchWeightedValue factor over hits from AvgDTWeightedByRankMobile stream (Mobile sessions filtered)",
  "1350": "FullMatchValue factor over hits from AvgDTWeightedByRankMobile stream (Mobile sessions filtered)",
  "1351": "MixMatchWeightedValue factor over hits from AvgDTWeightedByRankMobile stream (Mobile sessions filtered)",
  "1352": "Linguistic Boosting Factor. Type of extensions: XfDtShow. Factor: AvgPerTrigramMaxValueAny by stream group 5. Weighted average value of the factor by the top of extensions.",
  "1353": "AvgPerTrigramAvgValueAny factor by CorrectedCtrLongPeriod Stream",
  "1354": "DSSM model trained on clicks. Takes bigrams into account. Embeddings for documents are computed offline.",
  "1355": "The quality rank of the texts on the host. The higher - the more likely that the host is full of articles - rewrite, bad copywriting, ordered on content exchanges. It burns harder as query aggregation.",
  "1356": "Minimum from gradients according to the bigram LogDwelltime model.",
  "1357": "Maximum of the gradients according to the bigram LogDwelltime model.",
  "1358": "The second central point (variance) from the gradients according to the bigram LogDwelltime model.",
  "1359": "The third central point from the gradients according to the bigram LogDwelltime model.",
  "1360": "The probability that vk.com host is popular for this query according to the corresponding dssm model.",
  "1361": "The probability that the onliner.by host is popular for this query according to the corresponding dssm-model.",
  "1364": "The probability that the host rambler.ru is popular for this query according to the corresponding dssm-model.",
  "1365": "The probability that the host expertcen.ru is popular for this query according to the corresponding dssm-model.",
  "1366": "The probability that the host sunhome.ru is popular for this query according to the corresponding dssm-model.",
  "1367": "Static URL factor by browser logs for a maximum period. Percentage of traffic from social networks in all traffic from other hosts and search.",
  "1368": "Static URL factor by browser logs for maximum period. Average number of direct descendants from the host spent more than 90 seconds on it. The descendant is direct only if there is a link from our page to the descendant and it was clicked.",
  "1369": "Static URL factor by browser logs over maximum period. The average maximum tree depth with the root in the current URL when the URL is visited from other hosts.",
  "1370": "Static URL factor by browser logs over maximal period. The number of times the page has been accessed from the serp divided by the total number of pages accessed from the serp. The closer to 1, the more times the page was opened as the only page in the session.",
  "1371": "Static URL factor by browser logs for the maximum period. Average length of search sessions, when the page was navigated to from the serp",
  "1372": "Static URL factor by browser logs for maximal period. See the wiki for the formula to calculate the factor.",
  "1373": "Static URL factor by browser logs for maximal period. See the wiki for the formula to calculate the factor.",
  "1374": "Static URL factor by browser logs for maximal period. Probability that the user will spend > 120 seconds on the page.",
  "1375": "Static URL factor by browser logs for maximum period. The number of leaves in the URL subtree. In this case leaves are pages from which there were no jumps.",
  "1376": "Static URL factor from browser logs for the maximum period. The average time spent on the page and in all the descendants of the page (URLs to which were navigated) from the host. Cut if total Dt is more than 10 minutes",
  "1377": "Static URL factor by browser logs for maximal period. Minimum unix time when page first appeared in logs.",
  "1378": "Static URL factor by browser logs for maximal period. Difference between average and minimum unix time when page appeared in logs.",
  "1379": "Static URL factor by browser logs for maximum period. The average latitude from where the page was viewed.",
  "1380": "Static URL factor by browser logs for maximum period. Average longitude from where the page was viewed.",
  "1381": "Static URL factor by browser logs for maximum period. Probability of download from page",
  "1382": "Static URL factor by browser logs for maximum period. Probability of image download from page",
  "1383": "Static URL factor by browser logs for maximum period. Probability of downloading torrent file from page",
  "1384": "Static URL factor by browser logs for maximal period. See wiki for factor calculation formula. Localization to country level.",
  "1385": "Static URL factor by browser logs for maximum period. The number of leaves in the URL subtree. In this case leaves are pages from which there were no jumps. Localization to the country level.",
  "1386": "Static URL factor from browser logs for the maximum period. The average time spent on the page and in all the descendants of the page (URLs to which were navigated) from the host. Cut if total Dt is more than 10 minutes. Localization to country level.",
  "1387": "The sum of the query's scoring words according to the 3grams-yandex-direct language model.",
  "1388": "The sum of the query's scoring words according to the web-mt language model.",
  "1389": "Static URL factor based on browser logs over a maximum period. Rank, based only on UBLP counters, which allows to find many SBR losses",
  "1390": "Linguistic Boosting Factor. Extension type: Qfuf. Factor: BclmWeightedFLogW0_K0.001 by FieldSet3. Weighted average of factor values by top-10 extensions.",
  "1391": "Linguistic Boosting Factor. Extension type: QueryToText. Factor: by MinWindowSize by document content. Weighted average of factor values by extensions.",
  "1392": "Linguistic Boosting Factor. Average weight of extensions of QueryToText type.",
  "1393": "Linguistic Boosting Factor. Extension type: Qfuf. Factor: MixMatchWeightedValue by QueryDwellTime stream. Weighted average of the factor values by extensions.",
  "1394": "Linguistic Boosting Factor. Extension type: QueryToText. Factor: MinWindowSize by document content. Weighted average of the factor values by the top 10 extensions.",
  "1395": "Linguistic Boosting Factor. Extension type: Qfuf. Factor: Bm15FLogW0_K0.0001 by url and header. Maximum value of the factor by extensions.",
  "1396": "Linguistic Boosting Factor. Extension type: Qfuf. Factor: BclmWeightedFLogW0_K0.001 by FieldSet3. Weighted average of factor values by extensions.",
  "1397": "Linguistic Boosting Factor. The average weight of Qfuf-type extensions.",
  "1398": "Linguistic Boosting Factor. Extension type: QueryToText. Factor: PairMinProximity by document content. Average of factor values by extensions.",
  "1399": "Linguistic Boosting Factor. Type of extensions: Qfuf. The renormalized total weight of the extensions.",
  "1400": "Linguistic Boosting Factor. Extension type: QueryToText. Factor: Bocm11_Norm256 by document text. Average value of the factor by extensions.",
  "1401": "Linguistic Boosting Factor. Extension type: Qfuf. Factor: CosineMatchMaxPrediction by document text. Maximal value of the factor by extensions.",
  "1402": "Linguistic Boosting Factor. Extension type: Qfuf. Factor: Bm15FLog_K0.001 by FieldSet1. Weighted average of factor values with quadratic weight by the top 10 expansions by factor value.",
  "1403": "Linguistic Boosting Factor. Type of extensions: Qfuf. Factor:Bocm11_Norm256 by document text. Maximal value of the factor by extensions.",
  "1404": "Linguistic Boosting Factor. Extension type: Qfuf. Factor: Bm15FLogW0_K0.0001 by url and header. Weighted average of factor values by extensions.",
  "1405": "DSSM model trained on clicks, target=OneClicks/Clicks. Takes bigrams into account.",
  "1406": "DSSM model trained on clicks, target=QueryDwellTime stream value. Takes bigrams into account.",
  "1407": "The normalized sum of the weights of the query words that occurred in the text of the document or links to it.",
  "1408": "The normalized sum of the query word weights that EQUAL_BY_STRING in the document text or links to it.",
  "1409": "The normalized sum of the weights of the query words that appeared in the text of the document.",
  "1410": "The normalized sum of the weights of the query words that appeared in the links to the document.",
  "1411": "The normalized sum of the query word weights that EQUAL_BY_STRING in the document references.",
  "1412": "The normalized sum of weights by IFiltrationModel of query words that were encountered in the text of the document or references to it.",
  "1413": "The normalized sum of weights by IFiltrationModel for query words that EQUAL_BY_STRING in the document text or links to it.",
  "1414": "The normalized sum of weights by IFiltrationModel of query words that EQUAL_BY_LEMMA in the document text or links to it.",
  "1415": "The normalized sum of weights by IFiltrationModel of query words, which occurred in links to the document.",
  "1416": "Normalized sum of weights by IFiltrationModel of query words that are EQUAL_BY_STRING in document references.",
  "1417": "Linguistic Boosting Factor. Type of extensions: Qfuf. Aggregation by all extensions. Highest factor value. By stream from LinkAnnIndicator link index. Algorithm AnnotationMaxValueWeighted - maximum weight (by MainWeights word weights) of annotation coverage, weighted by annotation weight",
  "1418": "Linguistic Boosting Factor. Type of extensions: Qfuf. Aggregation by all extensions. Highest factor value. By stream from LinkAnnIndicator link index. Algorithm AnnotationMaxValueWeighted - maximum weight (by MainWeights word weights) of annotation coverage, weighted by annotation weight",
  "1419": "Linguistic Boosting Factor. Type of extensions: XfDtShow. Aggregation by all extensions. Largest weighted value of the factor. Normalized to the maximum weight of the extension. Based on stream from LinkAnnIndicator link index. PerWordCMMaxMatchMin algorithm: minimum CMMaxMatch weight by words.",
  "1420": "Linguistic Boosting Factor. Type of extensions: XfDtShowKnn (closest by dssm-model, trained to predict XfDtShow extensions). Aggregation over all extensions. Highest weighted factor value. A mixture of multiple streamlines, the weight is computed from a fixed polynomial of the component weights on a given annotation. The word weights aggregation algorithm is BclmMixPlain: a linear mixture of the annotation Bclm weight and the weighted Positionless word weight, then the word counters are aggregated via bm15. The normalization factor is 10^(-5).",
  "1421": "Linguistic Boosting Factor. Type of extensions: XfDtShowKnn (closest by dssm-model, trained to predict XfDtShow extensions). Aggregation over all extensions. Highest weighted factor value. Normalized to the maximum weight of the extension. Stream: CorrectedCtrLongPeriod. Degree of query word coverage with exact form (without synonyms).",
  "1422": "Linguistic Boosting Factor. Type of extensions: Qfuf. Aggregation over all extensions. Largest weighted value of the factor. Normalized to the maximum weight of the extension. Vpcg result for long long period, data: CorrectedClicks. Average weight of the annotations among those in which the query turned out to be an exact substring.",
  "1423": "Linguistic Boosting Factor. Type of extensions: XfDtShowKnn (closest by dssm-model, trained to predict XfDtShow extensions). Aggregation over all extensions. Largest weighted factor value. Normalized to the maximum weight of the extension. Stream: CorrectedCtrLongPeriod. Algorithm BclmPlaneProximity1Bm15W0Size1: uses bclm with weightless weighting if there are multiple query words, if there is one word then the match-weighted sum of hits is used. The normalization coefficient is 0.001.",
  "1424": "Linguistic Boosting Factor. Type of extensions: XfDtShowKnn (closest by dssm-model, trained to predict XfDtShow extensions). Aggregation over all extensions. Average weight of extensions.",
  "1425": "Document dssm model language classifier rus.",
  "1426": "Document dssm model language classifier eng.",
  "1427": "Document dssm model language classifier other.",
  "1431": "Predicting the DSSM model to determine irrelevant Alice responses",
  "1432": "The average value of News by request for the year. Calculated offline.",
  "1433": "The average value of AddTime by request for the year. Calculated offline.",
  "1434": "The average value of TxtHiRelSy for the query per year. Calculated offline.",
  "1435": "The average TextLike value per query for the year. Calculated offline.",
  "1436": "The average HasNoAllWordsTRSy value by query per year. Calculated offline.",
  "1437": "The average IsForum on the request for the year. Calculated offline.",
  "1438": "The average HasPayments on request for the year. Calculated offline.",
  "1439": "Average value of YabarHostAvgTime2 per request per year. Calculated offline.",
  "1440": "The average value of YabarUrlVisitors by request for the year. Calculated offline.",
  "1441": "Average value of QueryDOwnerOnlyClickRate by request per year. Calculated offline.",
  "1442": "The average DaterAge on request for the year. Calculated offline.",
  "1443": "The average value of LongestText by query for the year. Calculated offline.",
  "1444": "The average value of DifferentInternalLinks by query per year. Calculated offline.",
  "1445": "Average value of QueryDOwnerOnlyClickRate_Reg by query per year. Calculated offline.",
  "1446": "The average IsHub value per query per year. Calculated offline.",
  "1448": "Average BM25_0 on request for the year. Calculated offline.",
  "1449": "The average Bocm on demand for the year. Calculated offline.",
  "1450": "The average IsIndexPage value for the query per year. Calculated offline.",
  "1451": "The average value of QueriesAvgCM2 per request per year. Calculated offline.",
  "1452": "Average BrowserHostDownloadProbability by request per year. Calculated offline.",
  "1453": "The average value of RegBrowserUserHub per query per year. Calculated offline.",
  "1454": "The average value of AuxTitleBM25 on the request for the year. Calculated offline.",
  "1455": "The average value of QueryUrlCorrectedCtrXfactor by query per year. Calculated offline.",
  "1456": "Average QueryToDocAllSumFCountTextBm11Norm16384 by query for the year. Calculated offline.",
  "1457": "Average value of XfDtShowAllSumWFSumWBodyMinWindowSize by request per year. Calculated offline.",
  "1458": "The weighted average of the IsMainPage clicks per query per year. Calculated offline.",
  "1459": "The click-weighted average of YabarUrlAvgTime on the request for the year. Calculated offline.",
  "1460": "The click-weighted average of DifferentInternalLinks by query for the year. Calculated offline.",
  "1461": "Weighted average dwelltime-amy value of UrlDomainFraction by query per year. Calculated offline.",
  "1462": "BM25FdPR with normalization to the average document length depending on the document language. Only text hits are used.",
  "1463": "Does owner have metrika or not",
  "1464": "The document has a turbo page for the mobile platform.",
  "1465": "Document annotations count in the whole history of the Search (DSSM AnnReg models helper)",
  "1466": "Document annotation words count in the whole history of the Search (DSSM AnnReg models helper)",
  "1467": "Document annotation regions count in the whole history of the Search (DSSM AnnReg models helper)",
  "1472": "Query-MainContentKeywords similarity, target: logDwellTime",
  "1473": "Maximum value of domain yellowness (based on Toloka)",
  "1474": "Mean value of domain yellowness (based on Toloka)",
  "1475": "Median of domain yellowness (based on Toloka)",
  "1476": "Minimum value of domain yellowness (based on Toloka)",
  "1477": "Dssm Boosting query self similarity for XfWeight model.",
  "1478": "Dssm Boosting AvgTop02Score aggregation for XfWeight model over 5-means centroids.",
  "1479": "Dssm Boosting AvgTop04Score aggregation for XfWeight model over 5-means centroids.",
  "1480": "Dssm Boosting AvgTop02ScoreAvgClusterTop3Weighted aggregation for XfWeight model over 5-means centroids.",
  "1481": "Dssm Boosting AvgTop02Score aggregation for XfWeight model over 5-means centroids (query as expansion).",
  "1482": "Dssm Boosting AvgTop02ScoreAvgClusterTop3Weighted aggregation for XfWeight model over 5-means centroids (query as expansion).",
  "1483": "Dssm Boosting query self similarity for XfOne model.",
  "1484": "Dssm Boosting Score aggregation for XfOne model over 1-means centroids.",
  "1485": "Dssm Boosting ScaledSumWeight aggregation for XfOne model over 1-means centroids.",
  "1486": "Dssm Boosting Score aggregation for XfOne model over 1-means centroids (query as expansion).",
  "1487": "Dssm Boosting ScoreAvgNearest1Weighted aggregation for XfOne model over 1-means centroids (query as expansion).",
  "1488": "Dssm Boosting ScoreAvgNearest5Weighted aggregation for XfOne model over 1-means centroids (query as expansion).",
  "1489": "Dssm Boosting Score aggregation for XfOneSe model over 1-means centroids.",
  "1490": "Dssm Boosting ScoreScaledSumWeighted aggregation for XfOneSe model over 1-means centroids.",
  "1491": "Dssm Boosting ScoreAvgNearest5Weighted aggregation for XfOneSe model over 1-means centroids.",
  "1492": "Dssm Boosting query self similarity for Ctr model.",
  "1493": "Dssm Boosting Score aggregation for Ctr model over 1-means centroids.",
  "1494": "Dssm Boosting Score aggregation for Ctr model over 1-means centroids (query as expansion).",
  "1495": "Dssm Boosting ScoreScaledSumWeighted aggregation for Ctr model over 1-means centroids (query as expansion).",
  "1496": "Dssm Boosting ScoreAvgNearest1Weighted aggregation for Ctr model over 1-means centroids (query as expansion).",
  "1497": "Yellowness distribution dispersion of domain (based on Toloka)",
  "1498": "The vpcg result for the long long period, data: CorrectedClicks. FullMatchPrediction Factor",
  "1499": "The vpcg result for the long long period, data: CorrectedClicks. Factor AllWcmMatch95AvgValue",
  "1500": "The vpcg result for the long long period, data: CorrectedClicks. Factor CMMatchTop5AvgValue",
  "1501": "Result vpcg for the long long period, data: CorrectedClicks. Factor AnnotationMaxValueWeighted",
  "1502": "Result vpcg for long long period, data: CorrectedClicks. Factor MixMatchWeightedValue",
  "1503": "The vpcg result for the long long period, data: CorrectedClicks. Factor CMMatchTop5AvgPrediction",
  "1504": "DSSM model trained on CTRs without miner.",
  "1505": "Predicting dssm (url + title) trained on page_quality signal and embedded in RTHub, first slot.",
  "1506": "Predicting dssm (url + title), trained on page_quality signal and embedded in RTHub, second slot.",
  "1507": "The main components of request embedding from the DssmCtrNoMiner model",
  "1508": "The main components of request embedding from the DssmCtrNoMiner model",
  "1509": "The main components of request embedding from the DssmCtrNoMiner model",
  "1510": "The main components of request embedding from the DssmCtrNoMiner model",
  "1511": "The main components of request embedding from the DssmCtrNoMiner model",
  "1512": "The main components of request embedding from the DssmCtrNoMiner model",
  "1513": "DSSM model trained on click odd pool",
  "1514": "DSSM model trained on click personalization pool",
  "1515": "DSSM model trained on click triangle pool",
  "1516": "Linguistic Boosting Factor. Extension type: RequestWithRegionName. Factor: CMMatchTop5AvgMatchValue by Stream FloatMultiplicity of the LinkAnn index",
  "1518": "Linguistic Boosting Factor. Factor: PerWordAMMaxValueMin by Stream FloatMultiplicity of the LinkAnn index",
  "1519": "Linguistic Boosting Factor. Factor: AttenV1Bm15K001 by Stream FloatMultiplicity of the LinkAnn index",
  "1520": "Linguistic Boosting Factor. Factor: Bocm11Norm256 by Stream IsExternal of the LinkAnn index",
  "1522": "Linguistic Boosting Factor. Extension type: RequestWithRegionName. Factor: AnnotationMaxValue by Stream FloatMultiplicity of the LinkAnn index",
  "1523": "DSSM model trained on clicks without miner (with no-clicks and AM-hard negatives). Takes bigrams into account.",
  "1524": "AVG aggregation of HasPayments web factor using random log",
  "1525": "AVG aggregation of VideoQuery web factor using random log",
  "1526": "AVG aggregation of SyntQuality web factor using random log",
  "1527": "PERCENTALE_90 aggregation of GeoRegionalityVNew web factor using random log",
  "1528": "AVG aggregation of QClassDownload web factor using random log",
  "1529": "AVG aggregation of IsMusic web factor using random log",
  "1530": "PERCENTALE_25 aggregation of QueryThEncyclopedic web factor using random log",
  "1531": "AVG aggregation of CommercialOwnerRank_Reg web factor using random log",
  "1532": "PERCENTALE_25 aggregation of YabarWordDepthNodesGradientMin web factor using random log",
  "1533": "AVG aggregation of PopularSEFRCBrowser web factor using random log",
  "1534": "AVG aggregation of URLClicksMaxGeoRegionFRCRatio web factor using random log",
  "1535": "PERCENTALE_90 aggregation of UBLongPeriodDirectHChildren90CntFromExtHost web factor using random log",
  "1536": "PERCENTALE_90 aggregation of UBLongPeriodDtUrlHChildrenCut600Reg web factor using random log",
  "1537": "AVG aggregation of IsPicture web factor using random log",
  "1538": "AVG aggregation of ErratumLogQueryProbability web factor using random log",
  "1542": "Predicted by the query and country, using dssm-model the length of the click from the given country.",
  "1543": "Predicted by the neural network average News on demand for the year.",
  "1544": "Predicted by the neural network, the average AddTime value of the request for the year.",
  "1545": "Predicted by the neural network average value of TxtHiRelSy on the query for the year.",
  "1546": "Predicted by the neural network average TextLike value by query for the year.",
  "1547": "Predicted by the neural network average HasNoAllWordsTRSy on the query for the year.",
  "1548": "Predicted by the neural network of the average IsForum on the request for the year.",
  "1549": "Predicted by the neural network average HasPayments by request for the year.",
  "1550": "Predicted by the neural network average value of YabarHostAvgTime2 on the request for a year.",
  "1551": "Predicted by the neural network average value of YabarUrlVisitors by query for the year.",
  "1552": "Predicted by neural network average QueryDOwnerOnlyClickRate for the year.",
  "1553": "Predicted by the neural network average DaterAge on demand for the year.",
  "1554": "Predicted by the neural network average value of LongestText by query for the year.",
  "1555": "Predicted by the neural network average DifferentInternalLinks by query for the year.",
  "1556": "Predicted by the neural network average QueryDOwnerOnlyClickRate_Reg value for the year.",
  "1559": "Type of canonized url of Yandex music - track",
  "1560": "Predicted by the neural network average Bocm on demand for the year.",
  "1561": "The average IsIndexPage value of the query for the year predicted by the neural network.",
  "1562": "Predicted by the neural network average QueriesAvgCM2 value by query for the year.",
  "1563": "The average BrowserHostDownloadProbability value per request per year predicted by the neural network.",
  "1564": "Predicted by a neural network of the average RegBrowserUserHub value per query for the year.",
  "1565": "Predicted by the neural network average AuxTitleBM25 for the query for the year.",
  "1566": "Predicted by neural network average QueryUrlCorrectedCtrXfactor for the year.",
  "1567": "Predicted by neural network average QueryToDocAllSumFCountTextBm11Norm16384 for the year.",
  "1568": "Predicted by the neural network average XfDtShowAllSumWFSumWBodyMinWindowSize for the year.",
  "1569": "Predicted by the neural network of the weighted average of clicks IsMainPage on the request for the year.",
  "1570": "Predicted by the neural network weighted average by clicks YabarUrlAvgTime on the request for the year.",
  "1571": "Predicted by the neural network of the average click-weighted value of DifferentInternalLinks by query for the year.",
  "1572": "Predicted by neural network weighted average dwelltime-amy value of UrlDomainFraction by query for the year.",
  "1573": "Linguistic Boosting Factor. Type of extensions: XfDtShowKnn. Factor: BclmWeightedFLogW0 by stream group 3. Maximum weighted value of the factor.",
  "1574": "Linguistic Boosting Factor. Type of extensions: XfDtShowKnn. Factor: Bm15FLog by stream group 2. Maximum weighted value of the factor.",
  "1575": "Linguistic Boosting Factor. Extension type: XfDtShowKnn. Factor: Bag OriginalRequestFraction by Stream FieldSetBagOfWords.",
  "1576": "Linguistic Boosting Factor. Extension type: XfDtShowKnn. Factor: MixMatchWeightedValue by stream QueryDwellTime. Maximum weighted value of the factor normalized to the total weight.",
  "1577": "Linguistic Boosting Factor. Extension type: XfDtShowKnn. Factor: Bm15 by Title stream. Total weighted values of the factor multiplied by the weight (\\\\frac{\\\\Sum W_i * (W_i * F_i)}{\\\\Sum W_i}) normalized by the total weight.",
  "1578": "Linguistic Boosting Factor. Type of extensions: XfDtShowKnn. Factor: BclmWeightedFLogW0 by stream group 3. Minimum value of the factor by extension top.",
  "1579": "Linguistic Boosting Factor. Type of extensions: XfDtShowKnn. Factor: BclmWeightedFLogW0 by stream group 3. Total weighted values of the factor multiplied by the weight (\\\\frac{\\\\Sum W_i * (W_i * F_i)}{\\\\Sum W_i}) normalized by the total weight.",
  "1580": "Linguistic Boosting Factor. Type of extensions: XfDtShowKnn. Factor: Bm15FLog by stream group 1. Maximum weighted value of the factor.",
  "1581": "Linguistic Boosting Factor. Type of extensions: XfDtShowKnn. Factor: Bm15FLog by stream group 1. Total weighted value of the factor normalized to the total weight.",
  "1582": "Linguistic Boosting Factor. Extension type: XfDtShowKnn. Factor: Bag AnnotationMatchAvgValue by Stream LongClickSP.",
  "1583": "Linguistic Boosting Factor. Type of extensions: XfDtShowKnn. Factor: Bm15FLog by stream group 1. Total weighted values of the factor multiplied by the weight (\\\\frac{\\\\Sum W_i * (W_i * F_i)}{\\\\Sum W_i}) on the expansion group normalized by the total weight on the expansion group.",
  "1584": "Linguistic Boosting Factor. Type of extensions: XfDtShowKnn. Factor: Bm15FLog by stream group 1. Minimum weighted value of the factor on the extension top normalized to the maximum weight on the extension top.",
  "1585": "Linguistic Boosting Factor. Extension type: XfDtShowKnn. Factor: PairMinProximity by Stream Body. Maximum weighted value of the factor normalized to the total weight.",
  "1586": "Linguistic Boosting Factor. Type of extensions: XfDtShowKnn. Factor: Bm15FLog by stream group 1. Total weighted values of the factor multiplied by the weight (\\\\frac{\\\\Sum W_i * (W_i * F_i)}{\\\\Sum W_i}) normalized by the total weight.",
  "1587": "Linguistic Boosting Factor. Extension type: XfDtShowKnn. Factor: Bag AnnotationMatchAvgValue by Stream SimpleClick.",
  "1588": "Linguistic Boosting Factor. Extension type: XfDtShowKnn. Factor: Bag CosineMaxMatch by Stream Title.",
  "1589": "Predicting the probability that the query is localizable according to the Regionality5 rule.",
  "1594": "Document has Fio from original request",
  "1595": "Factor for experiments Page Quality 1",
  "1596": "DSSM model trained on clicks without miner (with no-clicks and am_hard negatives 50/50 and then on am_hard negatives only). Takes bigrams into account.",
  "1597": "Dssm Boosting Score aggregation for XfOneSeAmSsHard model over 1-means centroids.",
  "1598": "Dssm Boosting ScoreAvgClusterTop3Weighted aggregation for XfOneSeAmSsHard model over 1-means centroids.",
  "1599": "Factor for experiments Page Quality 2",
  "1600": "Average by url maximum yellowness of teaser image",
  "1601": "Average by url average yellowness of teaser image",
  "1602": "Ratio of yellow images in teasers on host",
  "1603": "Average yellow images count on host",
  "1604": "Average teasers count on host",
  "1605": "Average teasers area on host",
  "1606": "Average by url minimum yellowness of teaser text",
  "1607": "Average by url average yellowness of teaser text",
  "1608": "Background is clickable advertisement",
  "1609": "Average ratio of adverts on screen",
  "1610": "Ratio of adverts on screen on main page",
  "1611": "Average count of adverts on screen",
  "1612": "Ratio of outgoing advertisement traffic to all traffic (desktop)",
  "1613": "Ratio of outgoing real-time bidding traffic to all traffic (desktop)",
  "1614": "Rating of news agency from agencies.json (Yandex.News resource)",
  "1615": "Linguistic Boosting Factor. Extension type: QueryToTextByXfDtShowKnn. Factor: Norm256 by stream Bocm11. Total weighted factor values multiplied by weight (\\\\frac{\\\\Sum W_i * (W_i * F_i)}{\\\\Sum W_i}).",
  "1616": "Linguistic Boosting Factor. Extension type: QueryToTextByXfDtShowKnn. Factor: MinWindowSize by Stream Body. Total weighted factor values multiplied by weight (\\\\frac{\\\\\\Sum W_i * (W_i * F_i)}{\\\\Sum W_i}) by the extension top normalized by the total weight by the extension top.",
  "1617": "Linguistic Boosting Factor. Extension type: QueryToTextByXfDtShowKnn. Factor: MinWindowSize by Stream Body. Total weighted factor values multiplied by weight (\\\\frac{\\\\Sum W_i * (W_i * F_i)}{\\\\Sum W_i}) normalized by total weight.",
  "1618": "Linguistic Boosting Factor. Extension type: QueryToTextByXfDtShowKnn. Factor: Norm256 by stream Bocm11. Total weighted factor values multiplied by weight (\\\\frac{\\\\Sum W_i * (W_i * F_i)}{\\\\Sum W_i}) by extension top.",
  "1619": "Linguistic Boosting Factor. Extension type: QueryToTextByXfDtShowKnn. Minimal extension weight.",
  "1620": "Linguistic Boosting Factor. Type of extensions: QueryToTextByXfDtShowKnn. The arithmetic mean of the weights of the extensions.",
  "1621": "Linguistic Boosting Factor. Type of extensions: QueryToTextByXfDtShowKnn. Total weight of extensions.",
  "1622": "Linguistic Boosting Factor. Extension type: QueryToTextByXfDtShowKnn. Factor: Bag OriginalRequestFraction by Stream FieldSetBagOfWords.",
  "1623": "Factor for Page Quality 3 experiments",
  "1624": "Characterizes the query by the degree of change from adding a fixed word (number of some year), uses dssm model DssmBoostingXfOneSeAmSsHard",
  "1625": "Characterizes the query by the degree of change from adding a fixed word ('online' for Cyrillic), uses the dssm model DssmBoostingXfOneSeAmSsHard",
  "1626": "Characterizes the query by the degree of change from removing a fixed word ('site' for Cyrillic), uses the dssm model DssmBoostingXfOneSeAmSsHard",
  "1627": "Document from shards with fresh",
  "1628": "For each word offline the average HasNoTr value is calculated for the queries for 3 months. Then the maximum of this value is taken for all query words.",
  "1629": "The average IsLJ value is calculated for each word in the offline query over 3 months. Then the maximum of this value is taken for all query words.",
  "1631": "The average BclmLite value is calculated for each word in the offline query over 3 months. Then the minimum of this value is taken for all query words.",
  "1632": "For each word offline the average DBM40 for the queries for 3 months is calculated. Then for all non-stop query words the maximum of this value is taken.",
  "1633": "For each word offline the average value of IsDesktopRequest for queries over 3 months is calculated. Then the maximum of this value is taken for all non-stop query words.",
  "1634": "The average RLQAvgHasNoAllWordsTrSyn value is calculated for each word in the offline query over 3 months. Then the maximum of this value is taken for all query words.",
  "1635": "The average DssmAggregatedAnnReg value is calculated for each word in the offline query for 3 months. Then the maximum of this value is taken for all query words.",
  "1636": "For each word offline the average value of MetaNumUrlsPerHostFixed by queries for 3 months is calculated. Then the maximum of this value is taken for all query words.",
  "1637": "For each word offline the average value of MaxSDIsNavMxQueryMax is calculated for the queries for 3 months. Then for all non-stop query words the maximum of this value is taken.",
  "1638": "AVG aggregation of VisitsFromWiki web factor using random log",
  "1639": "Factor for experiments Page Quality 4",
  "1640": "PERCENTALE_25 aggregation of NavLinear web factor using random log",
  "1641": "PERCENTALE_90 aggregation of Found web factor using random log",
  "1642": "AVG aggregation of SubqueryThMatch web factor using random log",
  "1643": "Factor for experiments Page Quality 5",
  "1644": "AVG aggregation of SegmentWordPortionFromMainContent web factor using random log",
  "1645": "AVG aggregation of XfDtShowAllMaxFFieldSet2Bm15FLogK0001 web factor using random log",
  "1646": "AVG aggregation of QueryRegionSize web factor using random log",
  "1647": "The document came from WebTier1",
  "1648": "AVG aggregation of IsRelevLocaleUA web factor using random log",
  "1649": "PERCENTALE_90 aggregation of QfufAllSumWFSumWFieldSet3BclmWeightedFLogW0K0001 web factor using random log",
  "1650": "PERCENTALE_90 aggregation of DssmBoostingCtrQuerySelfSimilarity web factor using random log",
  "1651": "AVG aggregation of QueryToDocAllSumFCountTextBocm11Norm256 web factor using random log. NOTE: QueryToDocAllSumFCountTextBocm11Norm256 has been removed.",
  "1652": "PERCENTALE_90 aggregation of IsNavMxQuery web factor using random log",
  "1653": "The document came from Platinum0",
  "1654": "AVG aggregation of DBM15Wares2 web factor using random log",
  "1655": "PERCENTALE_90 aggregation of UrlNGramsModel web factor using random log",
  "1656": "A neural document model for finding unexpected tin",
  "1657": "Medical host quality fresh.",
  "1658": "PERCENTALE_25 aggregation of DssmBoostingCtrKMeans1ScoreScaledSumWeightedQE web factor using random log",
  "1659": "PERCENTALE_90 aggregation of LongClickMobileAllWcmWeightedValue web factor using random log",
  "1660": "PERCENTALE_25 aggregation of DssmVkPopularity web factor using random log",
  "1661": "AVG aggregation of UBLongPeriodVisitsSNProb web factor using random log",
  "1662": "PERCENTALE_90 aggregation of CountryQueryRegionality web factor using random log",
  "1663": "PERCENTALE_90 aggregation of TRhitw web factor using random log",
  "1664": "PERCENTALE_90 aggregation of UBLongPeriodAvgSearchDuration600 web factor using random log",
  "1665": "AVG aggregation of RequestIsFromIOS web factor using random log",
  "1666": "PERCENTALE_90 aggregation of DssmQueryEmbeddingCtrNoMinerPca4 web factor using random log",
  "1667": "AVG aggregation of XfDtShowAllMaxFFieldSetUTBm15FLogW0 web factor using random log",
  "1668": "PERCENTALE_25 aggregation of UrlTrigrams web factor using random log",
  "1669": "PERCENTALE_90 aggregation of DssmQueryEmbeddingCtrNoMinerPca1 web factor using random log",
  "1670": "AVG aggregation of IsRelevLocaleKZ web factor using random log",
  "1671": "PERCENTALE_90 aggregation of TextFeatures web factor using random log",
  "1672": "1 if host include js from marketgid.com",
  "1673": "1 if host include js from rfity.com",
  "1674": "DSSM prediction of google specificity for query",
  "1675": "Site owner pays attention to site details (at least once in quarter)",
  "1677": "Chat info. positive / events or zero",
  "1678": "Host player info. Relation between view time and video duration",
  "1679": "1 if host include js from google-analytics.com",
  "1680": "1 if host include js from googleapis.com",
  "1681": "1 if host include js from facebook.net",
  "1682": "1 if host include js from mc.yandex.ru",
  "1683": "Average value of RandomLogQueryAvgAddTime of the closest knn queries.",
  "1684": "Average value of RandomLogQueryAvgTxtHiRelSy of the nearest knn queries.",
  "1685": "Average value of RandomLogQueryAvgTextLike of the closest knn queries.",
  "1686": "Average value of RandomLogQueryAvgIsForum of the queries closest to knn.",
  "1687": "Average value of RandomLogQueryAvgHasPayments of the nearest knn queries.",
  "1688": "Average value of RandomLogQueryAvgDifferentInternalLinks of the closest knn queries.",
  "1689": "Average value of RandomLogQueryAvgIsTargetBussinessCard of the nearest knn queries.",
  "1690": "Average value of RandomLogQueryAvgQueryToDocAllSumFCountTextBm11Norm16384 of the nearest knn queries.",
  "1691": "Average value of RandomLogQueryAvgXfDtShowAllSumWFSumWBodyMinWindowSize of the nearest knn queries.",
  "1692": "Host speed estimation",
  "1693": "Is site official",
  "1695": "Quality link from good sites estimation",
  "1696": "Weight sum of each non-unique nevasca shingle",
  "1697": "Nevasca shingle quantity in last week",
  "1698": "Greentraffic share (aka direct visits). Desktop",
  "1699": "Greentraffic share (aka direct visits). Mobile",
  "1700": "Greentraffic absolute (desktop)",
  "1701": "Visits averaged by user",
  "1704": "1 if video on page",
  "1705": "Stream PCtrNew from yandex video",
  "1706": "Stream PCtrNew from yandex video",
  "1707": "Stream PCtrNew from yandex video",
  "1708": "Stream PCtrNew from yandex video",
  "1709": "Stream PCtrNew from yandex video",
  "1710": "Stream PCtrNew from yandex video",
  "1711": "The document has a turbo page. It depends on the platform",
  "1712": "Medical host quality for metric.",
  "1713": "Initial query with verb removal. It is counted by the title of the document. Algorithm of word weights aggregation: Bm15. The normalization coefficient is 0.1.",
  "1714": "Initial query with verb removal. It is computed from a compassionate stream consisting of a tokenized url and a document title. Algorithm of word weights aggregation: Bm15FLogW0. The normalization coefficient is 0.0001.",
  "1715": "Original query with verb removal. It is counted by the contents of the document. The minimum size of the window in which all query words are included. Normalized by the number of words in the query.",
  "1716": "Initial query with verb removal. Calculated using tokenized url. Algorithm of word weights aggregation: Bm15. The normalization coefficient is 0.1.",
  "1717": "RMSE aggregation of Long web factor using random log",
  "1718": "RMSE aggregation of IsOrg web factor using random log",
  "1719": "RMSE aggregation of GskUrlModel web factor using random log",
  "1720": "RMSE aggregation of DaterStatsAverageSourceSegment web factor using random log",
  "1721": "RMSE aggregation of VisitsFromWiki web factor using random log",
  "1722": "RMSE aggregation of XfDtShowBagOfWordsTitleCosineMaxMatch web factor using random log",
  "1723": "RMSE aggregation of UBLongPeriodDownloadsProb web factor using random log",
  "1724": "RMSE aggregation of MetaAvgIsNotCgi meta factor using random log",
  "1725": "RMSE aggregation of MetaRmsSynPercentBadWordPairs meta factor using random log",
  "1726": "RMSE aggregation of MetaPosTrigramsProb meta factor using random log",
  "1727": "PERCENTALE_90 aggregation of Bocm web factor using random log",
  "1728": "PERCENTALE_90 aggregation of SegmentWordPortionFromMainContent web factor using random log",
  "1729": "PERCENTALE_90 aggregation of IsMobileBeauty web factor using random log",
  "1730": "PERCENTALE_90 aggregation of USLongPeriodUrlWinsProb web factor using random log",
  "1731": "PERCENTALE_90 aggregation of DssmBoostingXfWeightKMeans5AvgTop02ScoreQE web factor using random log",
  "1732": "PERCENTALE_90 aggregation of DssmBoostingCtrKMeans1Score web factor using random log",
  "1733": "PERCENTALE_90 aggregation of SDIsNavMxQueryMax meta factor using random log",
  "1734": "PERCENTALE_90 aggregation of MetaWeb764Web1076ProductInvAvg meta factor using random log",
  "1735": "PERCENTALE_90 aggregation of MetaWeb1099Web1219ProductInvPos meta factor using random log",
  "1736": "PERCENTALE_90 aggregation of MetaMaxDssmMiddleVsShortLongHardNoClicks meta factor using random log",
  "1737": "MAX aggregation of NumLinksFromMP web factor using random log",
  "1738": "MAX aggregation of NavLinear web factor using random log",
  "1739": "MAX aggregation of DaterStatsAverageSourceSegment web factor using random log",
  "1740": "MAX aggregation of WeightedSumIsIndexPageIsNavMxQuery web factor using random log",
  "1741": "MAX aggregation of QueryToDocAllSumFCountTextBocm11Norm256 web factor using random log. NOTE: QueryToDocAllSumFCountTextBocm11Norm256 has been removed.",
  "1742": "MAX aggregation of DssmBigramsQueryDerivativeMax web factor using random log",
  "1743": "MAX aggregation of DssmQueryCountryToUrlEstimatedDistance web factor using random log",
  "1744": "MAX aggregation of MetaWeb764Web1076ProductInvAvg meta factor using random log",
  "1745": "LOGAVG aggregation of TextFeatures web factor using random log",
  "1746": "LOGAVG aggregation of DocLen web factor using random log",
  "1747": "LOGAVG aggregation of IsHTML web factor using random log",
  "1748": "LOGAVG aggregation of HasLevensht1QueryFragment web factor using random log",
  "1749": "LOGAVG aggregation of HeadingIdfSumFixed web factor using random log",
  "1750": "LOGAVG aggregation of AdvPronounsPortion web factor using random log",
  "1751": "LOGAVG aggregation of LongestText web factor using random log",
  "1752": "LOGAVG aggregation of CountryHour web factor using random log",
  "1753": "LOGAVG aggregation of MetrikaUrlAvgTime web factor using random log",
  "1754": "LOGAVG aggregation of WikiLinkCount web factor using random log",
  "1755": "LOGAVG aggregation of BrowserUrlDwellTimeRegionFrc web factor using random log",
  "1756": "LOGAVG aggregation of WikiInfobox web factor using random log",
  "1757": "LOGAVG aggregation of QueryDocTitleRangesMatchingScore web factor using random log",
  "1758": "LOGAVG aggregation of IsMobileBeauty web factor using random log",
  "1759": "LOGAVG aggregation of QueryToTextAllSumWFSumWBodyMinWindowSize web factor using random log",
  "1760": "LOGAVG aggregation of DssmRandomLogQueryAvgDifferentInternalLinks web factor using random log",
  "1761": "LOGAVG aggregation of MetaUrlDirectChildrenCnt meta factor using random log",
  "1762": "LOGAVG aggregation of MetaWeb1241Web1299ProductInvPos meta factor using random log",
  "1763": "LOGAVG aggregation of MetaEpsHashShareNationalLanguage meta factor using random log",
  "1764": "The document has the https protocol",
  "1765": "The Levenshtein distance between the query and the url of the form youtubecom/watch normalized to the maximum of the length of the query and the url",
  "1766": "The length of the longest common substring between the url and the query normalized to the query length",
  "1767": "The sigmoid normalized value of the porn text query classifier as estimated from Toloka",
  "1768": "Binarized value of the porn text query classifier by estimates from Toloka",
  "1769": "The [0,1] value of the porn text query classifier as estimated by the web classifier and additional dictionaries",
  "1770": "Binarized using fxlists text query classifier porn value by web classifier estimates and additional dictionaries",
  "1771": "The presence of foul language in the query. 0 - absent, 0.5 - not hard, 1 - hard",
  "1772": "Presence of porn markers in the query (0 - yes, 1/3 - no, 1 - query 'gray')",
  "1774": "Document Classification of Pornography, Fiches by Document Text",
  "1775": "Document pornography classifier, document url based features",
  "1776": "Document classifier for pornography, document image-based features (information is taken from the Picture Index)",
  "1777": "Document classifier for pornography, chips by video document (information is taken from the Video index)",
  "1778": "Host pornography classifier, chips about pornography queries that were shown and clicked on by the host",
  "1779": "The presence of the word official in a lemmatized query",
  "1780": "Presence of the word wikipedia in a lemmatized query",
  "1781": "The presence in a lemmatized query of the word not and similar in meaning",
  "1782": "The presence in the lemmatized query of the words buy, price and similar in meaning",
  "1783": "The return factor on the host. Percentale aggregation with 0.25f of DwellTimeSumFraction",
  "1784": "The document came from QuickMed",
  "1785": "Return Factor per host. Percentale aggregation with a factor of 0.99f of the AverageReturnTime chip",
  "1786": "Return Factor per host. Percentale aggregation with a factor of 0.97f of the AverageReturnTime fic",
  "1787": "Return Factor per host. GreaterFraction aggregation with 0.99f of fic AverageReturnTime",
  "1788": "The return factor on the host. Percentale aggregation with a factor of 0.99f of the AverageLogReturnTime chip",
  "1789": "The return factor on the host. GreaterFraction aggregation with 0.9f of AverageLogReturnTime",
  "1790": "Returns factor on the host. LessFraction aggregation with 0.05f fic FirstClickDwellTime",
  "1791": "Host return factor. WeightedAverage aggregation of AverageVisitsPer3Hours",
  "1792": "Medical host quality.",
  "1793": "The document has a turbo page for the desktop platform. Updates on top of the base are delivered via saas.",
  "1794": "Host return factor. WeightedAverage aggregation of AverageDwellTimePerHour feature",
  "1795": "The return factor on the host. LessFraction aggregation with 0.1f of fic AverageDwellTimePer3Hours",
  "1796": "Host return factor. Max aggregation of AverageDwellTimePerWeek feature",
  "1797": "The median dwelltime of the request over the entire history. The dwelltime is truncated to 6000. The query is normalized by doppelgangers",
  "1798": "The number of query hits with more than one click in the whole history. The query is normalized by doppelgangers",
  "1799": "Share of displays of the query with more than one click from all displays for the whole history. The query is normalized by doppelgangers",
  "1800": "Owner aggregation of RandomLogWordMaxMetaNumUrlsPerHostFixed web factor using random log, aggregation type is PERCENTALE_90",
  "1801": "Owner aggregation of MetaWeb1099Web1219ProductInvPos meta factor using random log, aggregation type is LOGAVG",
  "1802": "Owner aggregation of DssmDwelltimeRegChainTrainedEmbedding meta factor using random log, aggregation type is PERCENTALE_90",
  "1803": "Owner aggregation of DssmRandomLogQueryAvgHasPayments web factor using random log, aggregation type is LOGAVG",
  "1804": "Owner aggregation of UBLongPeriodBrowseFrc web factor using random log, aggregation type is PERCENTALE_90",
  "1805": "Owner aggregation of MetaUrlChildrenCnt meta factor using random log, aggregation type is LOGAVG",
  "1806": "Owner aggregation of MetaRmsDifferentInternalLinks meta factor using random log, aggregation type is PERCENTALE_25",
  "1807": "Owner aggregation of RandomLogWordMaxHasNoTr web factor using random log, aggregation type is PERCENTALE_90",
  "1808": "Owner aggregation of MetaResidUSLongPeriodUrlWinsProb meta factor using random log, aggregation type is RMSE",
  "1809": "Owner aggregation of PornoQuery web factor using random log, aggregation type is LOGAVG",
  "1810": "Owner aggregation of NationalLanguage web factor using random log, aggregation type is LOGAVG",
  "1811": "Owner aggregation of PercentVisibleContent web factor using random log, aggregation type is PERCENTALE_90",
  "1812": "Owner aggregation of MetaWeb1241Web1299ProductInvPos meta factor using random log, aggregation type is PERCENTALE_25",
  "1813": "Owner aggregation of LinkAnnFloatMultiplicityAttenV1Bm15K001 web factor using random log, aggregation type is LOGAVG",
  "1814": "Owner aggregation of UBLongPeriodLeavesCnt web factor using random log, aggregation type is RMSE",
  "1815": "Owner aggregation of NumLinksFromMP web factor using random log, aggregation type is LOGAVG",
  "1816": "Owner aggregation of DssmRandomLogQueryAvgDifferentInternalLinks web factor using random log, aggregation type is PERCENTALE_25",
  "1817": "Owner aggregation of IsOrg web factor using random log, aggregation type is RMSE",
  "1818": "Owner aggregation of QSegmentsBM25 web factor using random log, aggregation type is MAX",
  "1819": "Owner aggregation of SegmentAuxAlphasInText web factor using random log, aggregation type is RMSE",
  "1820": "Owner aggregation of RandomLogQueryDwelltimeWeightedAvgUrlDomainFraction web factor using random log, aggregation type is LOGAVG",
  "1821": "Owner aggregation of RandomLogWordSkipStopWordsMaxIsDesktopRequest web factor using random log, aggregation type is LOGAVG",
  "1822": "Owner aggregation of VisitsFromWiki web factor using random log, aggregation type is RMSE",
  "1823": "Owner aggregation of IsText web factor using random log, aggregation type is RMSE",
  "1824": "Owner aggregation of DBMSubstantive web factor using random log, aggregation type is MAX",
  "1825": "Owner aggregation of DaterStatsAverageSourceSegment web factor using random log, aggregation type is RMSE",
  "1826": "Owner aggregation of IsMobileBeauty web factor using random log, aggregation type is LOGAVG",
  "1827": "Owner aggregation of LongClickSPMixMatchWeightedValue web factor using random log, aggregation type is PERCENTALE_90",
  "1828": "Owner aggregation of FemAndMasNounsPortion web factor using random log, aggregation type is LOGAVG",
  "1829": "Owner aggregation of TrigramsProb web factor using random log, aggregation type is PERCENTALE_90",
  "1830": "Owner aggregation of DaterStatsYearNormLikelihood web factor using random log, aggregation type is PERCENTALE_25",
  "1831": "Owner aggregation of UrlPathAndParamsFraction web factor using random log, aggregation type is MAX",
  "1832": "The average value for the query factor according to QueryToText linguobusting, calculated in the LingBoostQueryFeatures behemoth rule",
  "1833": "The average value for the query factor according to QueryToTextByXfDtShowKnn lingvobusting, calculated in the LingBoostQueryFeatures behemoth rule",
  "1834": "sum / (sum + 10) for the query factor according to XfDtShow lingvobusting, calculated in the LingBoostQueryFeatures behemoth rule",
  "1835": "Quantile 0.1 for query factor according to XfDtShow lingvobusting, calculated in behemoth rule LingBoostQueryFeatures",
  "1836": "Quantile 0.1 for query factor according to XfDtShowKnn lingvobusting, calculated in behemoth rule LingBoostQueryFeatures",
  "1837": "Quantile 0.9 for query factor according to XfDtShowKnn lingvobusting, calculated in LingBoostQueryFeatures behemoth rule",
  "1838": "sum / (sum + 10) for the query factor according to Qfuf lingvobusting, calculated in the LingBoostQueryFeatures behemoth rule",
  "1839": "The average value for the query factor according to Qfuf lingvobusting, calculated in the LingBoostQueryFeatures behemoth rule",
  "1840": "The site is located in the Tas-IX network (relevant to Uzbekistan)",
  "1841": "Dssm Boosting Score for SerpSimilarityHard model over 1-means centroids.",
  "1842": "Page quality aggregated by host (avg).",
  "1843": "relev_local == uz",
  "1844": "25% quantile of time from the previous query before the current query. The query is normalized by doppelgangers",
  "1845": "The result of applying a neural model trained to distinguish long clicks from other events, the input of the model are word and bigram counters, calculated from text streamlines (Title, Body, Url).",
  "1846": "Is this host adapted for mobile devices",
  "1847": "Linguistic Boosting Factor. Extension type: QfufFilteredByXfOneSe (qfuf, filtered by dssm-model XfOneSe). Aggregation over all extensions. Highest factor value. Weighted stream aggregation of Url, Title, Body, CorrectedCtr, LongClick, OneClick, BrowserPageRank, SplitDwellTime, SamplePeriodDayFrc, SimpleClick, YabarVisits, YabarTime. Word weights aggregation algorithm: Bm15FLog (Bm15 aggregation of word occurrence logarithms). The normalization coefficient is 0.001.",
  "1848": "Linguistic Boosting Factor. Extension type: QfufFilteredByXfOneSe (qfuf, filtered by dssm-model XfOneSe). Aggregation over all extensions. Highest factor value. Weighted aggregation of Title, Body, LongClick, LongClickSP, OneClick streamlines. Algorithm of word weights aggregation: BclmWeightedFLogW0. Normalization coefficient 0.001.",
  "1849": "The linguistic boosting factor. Extension type: QfufFilteredByXfOneSe (qfuf, filtered by dssm-model XfOneSe). Aggregation over all extensions. Highest factor value. Counted by a compassionate stream consisting of a tokenized url and a document title. Algorithm of word weights aggregation: Bm15FLogW0. The normalization coefficient is 0.0001.",
  "1850": "Linguistic Boosting Factor. Extension type: QfufFilteredByXfOneSe (qfuf, filtered by dssm-model XfOneSe). Aggregation over all extensions. Highest factor value. Counted by document title. Algorithm of word weights aggregation: Bm15. Normalization coefficient 0.1.",
  "1851": "The linguistic boosting factor. Type of extensions: QfufFilteredByXfOneSe (qfuf, filtered by dssm-model XfOneSe). Aggregation by top-10 (by factor value) extensions. Weighted sum of factor weights. Normalized by total weight of extensions. Weighted stream aggregation of Url, Title, Body, CorrectedCtr, LongClick, OneClick, BrowserPageRank, SplitDwellTime, SamplePeriodDayFrc, SimpleClick, YabarVisits, YabarTime. Word weights aggregation algorithm: Bm15FLog (Bm15 aggregation of word occurrence logarithms). The normalization coefficient is 0.001.",
  "1852": "The linguistic boosting factor. Type of extensions: QfufFilteredByXfOneSe (qfuf, filtered by dssm-model XfOneSe). Aggregation by top-10 (by factor value) extensions. Weighted sum of factor weights. Normalized by total weight of extensions. Calculated by document content. Minimum window size that includes all query words. Normalized by the number of words in the query.",
  "1853": "Factor on filtered original query: dssm-distance from query without words to original query is calculated, then cutoff by threshold. Weighted stream aggregation Url,Title,Body,Links,CorrectedCtr,LongClick,OneClick,BrowserPageRank,SplitDwellTime,SamplePeriodDayFrc,SimpleClick,YabarVisits,YabarTime. Word weights aggregation algorithm: Bm15FLog (Bm15 aggregation of word occurrence logarithms). The normalization coefficient is 0.001.",
  "1854": "Factor on filtered original query: the dssm-distance from query without words to the original query is calculated, followed by a threshold cutoff. It is computed by compassed stream, consisting of tokenized url and document header. Word weight aggregation algorithm: Bm15FLogW0. The normalization coefficient is 0.0001.",
  "1855": "DSSM model trained on cross language CTRs using serp similarity hard miner.",
  "1857": "For all words of the query weights are calculated by the query-mutation method (distance between queries in the presence and absence of a word). We take the sum of weights of words found in the title, divided by the sum of weights of all words.",
  "1858": "For all query words, the weight is calculated using the query-mutation method (the distance between queries if a word is present or absent). The maximum weight among the words missing in the document title is taken.",
  "1859": "The result of applying a neural model trained to distinguish long clicks from other events, the input of the model are word and bigram counters, calculated from text streamlines (Body, Url).",
  "1861": "Calculated as (80-x) where x is the document's age in hours (continuous). Uses data from the RobotAddTime dater",
  "1862": "Calculated as (10-x) where x is the document's age in days (continuous). Uses data from the RobotAddTime dater",
  "1863": "The difference between the current date and the date of the document defined by RobotAddTime, 1 - the date is equal to the current date, 0 - the document is 10 days or more, or the date is not defined",
  "1864": "Linguistic Boosting Factor. Type of extensions: XfOneSeKnn (closest by dssm-model, trained to predict XfDtShow extensions). Aggregation over all extensions. Highest weighted factor value. Normalized to the maximum weight of the extension. Weighted aggregation of stream Url,Title,Body,Links,CorrectedCtr,LongClick,OneClick,BrowserPageRank,SplitDwellTime,SamplePeriodDayFrc,SimpleClick,YabarVisits,YabarTime. Word weights aggregation algorithm: Bm15FLog (Bm15 aggregation of word occurrence logarithms). The normalization coefficient is 0.001.",
  "1865": "Linguistic Boosting Factor. Type of extensions: XfOneSeKnn (closest by dssm-model, trained to predict XfDtShow extensions). Aggregation over all extensions. Highest weighted factor value. Normalized to the maximum weight of the extension. TODO Algorithm: Maximum weight of the fully matched query annotation. Calculated by OneClick stream.",
  "1866": "Linguistic Boosting Factor. Type of extensions: QueryToTextByXfOneSeKnn (QueryToText extensions XfOneSeKnn). Aggregation by top-10 (by factor value) extensions. Weighted sum of factor weights. Normalized by total weight of extensions. Calculated by document content. Minimum window size that includes all query words. Normalized by the number of words in the query.",
  "1867": "Linguistic Boosting Factor. Extension type: QueryToTextByXfOneSeKnn (QueryToText extensions XfOneSeKnn). Aggregation over all extensions. Weighted sum of factor weights. Normalized by total weight of extensions. Weighted aggregation of Title, Body, LongClick, LongClickSP, OneClick strips. Word weights aggregation algorithm: BclmWeightedFLogW0. Normalization coefficient 0.001.",
  "1868": "Domain in the international zone",
  "1869": "The request was recognized as having an interest in copyrighted works protected by the Anti-Piracy Memorandum.",
  "1870": "The host contains pirated videos protected by the Anti-Piracy Memorandum.",
  "1871": "host contains videos protected by the Anti-Piracy Memorandum.",
  "1872": "Average host freshness over 30 days",
  "1873": "Proportion of documents with positive freshness surplus from the host in 30 days",
  "1874": "Stevenson",
  "1875": "Stevenson",
  "1876": "Stevenson",
  "1877": "Stevenson",
  "1878": "Stevenson",
  "1879": "The renormalized predicate ethos classifier by markup on the relevance of the video.",
  "1880": "Renormalized ethos predictor of the classifier trained on the synthetic sample 'query is typical for a pirate site' vs 'query is typical for a site far from it'",
  "1881": "there has never been a non-zero feature in this slot",
  "1882": "Regression on dssm embeddings to separate memorandum and non-memorandum requests",
  "1883": "A renormalized ethos predicate of a classifier trained to distinguish memorandum queries from random",
  "1884": "Regression on dssmembeds to separate pirate-specific and non-pirate-specific queries",
  "1885": "DSSM model, which predicts the logarithm of the longest click on the serpent. As negative examples, we choose urls from past queries of the same user, with a maximum time between queries of no more than 7 minutes (superhards on reformulations)",
  "1886": "The document came from Quick but not from QuickRt",
  "1887": "The document came from QuickRt",
  "1888": "The document came from Callisto",
  "1889": "Feature LegalPlayers from VideoIndex",
  "1890": "Feature SocialNetworksPlayers from VideoIndex",
  "1891": "Feature StevensonPlayers from VideoIndex",
  "1892": "DSSM model with early binding, trained on reformulations, which predicts the logarithm of the longest click on the serpent.",
  "1893": "Rating of news agency from agencies.json > 0 (Yandex.News resource)",
  "1894": "Weekday query probability",
  "1895": "Indicator of the quality of the site in terms of factors about user behavior, aggregated to the owners.",
  "1896": "Neural network value for contexts of query hits in document text. Predicts relevance-all-8-years. Uses formula ussr-dump-20190719 prs-20190720 all-8-years [t > 0.25] CrossEntropy 20k 0.25 -S 0.8 -Z 1 predictions for learning.",
  "1897": "Bans of Antispam from erf",
  "1898": "DSSM model trained on the reformulation pool, which in the query part besides the query itself receives 4 XfDt extensions with the highest weight",
  "1899": "Aggregated by the closest on the host LogAvg-statistics of the IsMobileRequest factor",
  "1900": "LogAvg-statistics of the NanobtaniumQueryWordTitle5nDist2maxXMax factor aggregated by the closest urls on the host",
  "1901": "Bans on gsm of Antispam from erf",
  "1902": "Bans on fresh of Antispam from erf",
  "1903": "The average IsBlog by query for the year. Calculated offline.",
  "1904": "The document has a turbo page for the mobile platform. Updates on top of the base are delivered via saas.",
  "1905": "The document has a turbo page for the desktop platform. Updates on top of the base are delivered via saas.",
  "1906": "Model trained on prediction estimate formula ussr-dump-20190719 prs-20190720 all-8-years [t > 0.25] CrossEntropy 20k 0.25 -S 0.8 -Z 1.",
  "1908": "The 'random' factor for commercial sites.",
  "1909": "Neural document model for finding unexpected tin (for exps)",
  "1910": "Features calculated on url with request multitokens expansion",
  "1911": "Features calculated on url with request multitokens expansion",
  "1912": "Model trained on prediction estimates by formula ussr-dump-20190719 prs-20190720 all-8-years [t > 0.25] CrossEntropy 20k 0.25 -S 0.8 -Z 1 and pre-trained on relevance estimates.",
  "1913": "The share of queries that showed the owner's face among all queries that showed the owner in the last week.",
  "1914": "Percentage of visits from the document sickle that are at 0 hops. Over 30 days.",
  "1915": "The average position of the owner on the queries for the last week.",
  "1916": "The ratio of mobile to desktop by search engine traffic.",
  "1917": "Mobile-to-desktop ratio for all outbound traffic.",
  "1918": "The average value of the query factor isorg for queries with the given owner for the last week.",
  "1919": "The average ratio of punctuation to all separators in the owner's documents.",
  "1920": "The value of the freshness detector calculated in behemoth. Always 0 when the detector value is less than the threshold.",
  "1921": "host contains videos protected by the Anti-Piracy Memorandum.",
  "1922": "Stevenson"
}